{ "_id" : { "$oid" : "539c23dc0b66310b45a14fbf" }, "author" : "Cory Dodt", "ingredients" : [ "2 cups water, warmed 110 degrees F", "2/3 cup white sugar", "3 to 4.5 tsp active dry yeast, (1.5 - 2 packets)", "1 1/2 tsp salt", "1/4 cup vegetable oil", "6 cups bread flour", "" ], "instructions" : [ "YEAST TIPS: Water should not be too hot or too cold. Sugar first, salt later, Don't let it proof too long... 10 minutes is about right. In cold weather, let it rise longer, or let it rise in a room-temperature oven. Moist is good.", "In a large bowl, dissolve the sugar in warm water, and then stir in yeast. Allow to proof until yeast resembles a creamy foam.", "Mix salt and oil into the yeast. Mix in flour one cup at a time. Knead dough on a lightly floured surface until smooth. Place in a well-oiled bowl, and turn dough to coat. Cover with a damp cloth. Store it somewhere warm. Allow to rise until doubled in bulk, about 1 hour.", "Punch dough down. Knead for a few minutes, and divide in half. Shape into loaves, and place into two well-oiled 9x5 inch loaf pans. Allow to rise for 30 minutes, or until dough has risen 1 inch above pans.", "Bake at 350 degrees F (175 degrees C) for 30 minutes.", "(118 calories per slice.)" ], "name" : "Amish White Bread", "recipeYield" : "2 loaves", "tags" : [ "bread", "white" ], "url" : "amish-white-bread" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fc0" }, "author" : "Cory Dodt", "ingredients" : [ "2 cups salted caramel ice cream, microwaved soft (30s)", "1 1/2 cups self-rising flour", "1 apple, cored, chopped", "1/2 tsp cinnamon" ], "instructions" : [ "Preheat oven to 350 F. Spray an 8 1/2 x 4 1/2 loaf pan with baking spray.", "In a large bowl, stir ice cream until smooth. Stir in flour until just blended. Add apple and cinnamon. Scoop into prepared pan. Bake 43 to 48 minutes until toothpick inserted in center comes out clean.", "Cool on wire rack 10 minutes. Invert loaf onto cooling rack. Serve warm or cool completely." ], "name" : "Apple Pie Cake Bread", "recipeYield" : "1 loaf", "tags" : [ "dessert", "ice cream", "bread", "two ingredients", "GOOD" ], "url" : "apple-pie-cake-bread" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fc1" }, "author" : "Cory Dodt", "ingredients" : [ "1 1/4 quarts apple cider", "3 tbsp light-brown sugar, firmly packed", "7 cinnamon sticks, (keep 6 for garnish)", "1 tsp allspice", "1/2 tsp ground ginger", "Ground cloves", "Nutmeg", "Salt", "1/2 cup brandy (optional)" ], "instructions" : [ "In a medium saucepan, whisk together cider, sugar, spices (including one cinnamon stick), and salt. Bring to a simmer over medium-low heat. Remove from heat. Pour in brandy, if desired.", "Strain into a pitcher. Discard solids.", "Serve in mugs, garnished with cinnamon sticks." ], "name" : "Apple Pie Spiced Cider", "recipeYield" : "6", "tags" : [ "apple", "cider", "alcohol", "beverage", "GOOD" ], "url" : "apple-pie-spiced-cider" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fc2" }, "author" : "Cory Dodt", "ingredients" : [ "Pizza stone and peel", "3 cloves garlic, minced", "1 cup onion, (about half an onion) chopped small", "1/2 cup marinated artichoke hearts, drained, chopped small", "1/2 cup marinated red pepper, drained, chopped small (optional)", "1/4 cup black olives, sliced (optional)", "1/4 cup green onions, sliced (optional)", "1/4 cup spinach, chopped small (optional)", "Flour", "1 package Trader Joe's herb pizza dough", "1 cup pizza sauce", "3 cups shredded mozzarella or cheddar cheese, or a combination", "2 oz light feta cheese crumbles" ], "instructions" : [ "Preheat oven to the maximum temperature, 550 usually. Place your cold pizza stone in the oven as it starts to heat.", "Sautee onions with minced garlic over medium-high heat for several minutes, until just starting to turn translucent.", "Flour your pizza peel well, place the dough in the middle and cover it with wax paper. Roll out the dough into a pizza shape. Pinch the edges into a crust.", "Spread pizza sauce heavily over the pizza. Every bit of pizza dough should be covered, although you may be able to see the color of the dough in spots.", "Spread the shredded cheese evenly over the sauce. The sauce should be completely covered, but you may be able to see the red color in spots and around the edges.", "Spread the sauteed onions, artichokes and any other vegetables over the pizza.", "Sprinkle feta cheese crumbles evenly over the pizza.", "Carefully slide the pizza onto the hot pizza stone in the oven.", "Bake for 11-15 minutes, until edges are medium brown and feta cheese has melted." ], "name" : "Artichoke Pizza", "recipeYield" : "8", "tags" : [ "pizza", "artichoke", "onion" ], "url" : "artichoke-pizza" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fc3" }, "author" : "Cory Dodt", "ingredients" : [ "VINAIGRETTE", "1/4 cup balsamic vinegar", "1 clove garlic, minced", "1/2 tbsp honey", "1 tbsp dijon mustard", "salt", "pepper", "4 tbsp olive oil", "", "SALAD", "Arugula", "1 medium pear, quartered, cored, thinly sliced", "1/2 bulb fennel, thinly sliced", "1/4 cup pecans, chopped, toasted" ], "instructions" : [ "VINAIGRETTE: in a small bowl, combine all vinaigrette ingredients EXCEPT olive oil, and whisk together.", "Let stand 10 minutes.", "Slowly drizzle in olive oil while whisking.", "", "SALAD: Arrange a bed of arugula on each plate. Top with pear, fennel, and pecans. Drizzle with vinaigrette." ], "name" : "Arugula Pear Pizza with Vinaigrette", "recipeYield" : "4", "tags" : [ "salad", "pear", "vinaigrette", "dijon", "GOOD" ], "url" : "arugula-pear-pizza-with-vinaigrette" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fc4" }, "author" : "Cory Dodt", "ingredients" : [ "2 cups all-purpose flour, sifted", "1/2 cup white sugar", "1 1/2 tsp baking powder", "1 tsp salt", "2 eggs, beaten", "1 1/2 cups beer", "1/2 cup milk", "4 tbsp butter, melted", "Cooking spray or oil" ], "instructions" : [ "In a large bowl, stir together the flour, sugar, baking powder and salt. Pour in the egg, beer, milk and melted butter; stir with a whisk just until blended--a few lumps are okay.", "Heat a skillet or griddle to medium heat. Coat with vegetable oil or cooking spray. Spoon about 1/4 cup of batter onto the hot surface for each pancake. When bubbles appear on top of the pancakes, flip, and cook until browned on the other side." ], "name" : "Beer Pancakes", "recipeYield" : "8 pancakes", "tags" : [ "beer", "pancakes", "breakfast", "GOOD" ], "url" : "beer-pancakes" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fc5" }, "author" : "Cory Dodt", "ingredients" : [ "SPECIAL TOOLS", "Pizza stone, (recommended)", "Frosting spreader/spatula, (recommended)", "Baking scraper/slicer, (recommended)", "Cheesecloth or nut milk bag with a very fine mesh", "2 1-quart plastic containers, Ziploc or something else sturdy; don't get the cheap ones because they crack", "Rubber bands, large enough to fit tightly on the containers", "", "CANNABUTTER", "1 oz marijuana, decarboxylated (see instructions)", "2 cups water, and more as needed", "1 lb unsalted butter" ], "instructions" : [ "MARIJUANA PREP (decarboxylation) Preheat the oven to 240F.", "GRIND the marijuana very fine. A coffee grinder works, but I prefer a mortar and pestle. NOTE: don't use a marijuana grinder, it grinds too coarsely.", "SPREAD the ground cannabis thinly and evenly on a pizza stone or cookie sheet. Bake in the preheated oven for 60 minutes.", "Let the stone cool, then SCRAPE the powder into a bowl, and set it aside. You may wish to use your scraper/slicer to get every last particle of powder off the stone.", "", "CANNABUTTER Bring 2 cups water to a low boil in a large saucepan.", "When the water boils, REDUCE heat to medium and STIR in the butter, a few tbsp at a time. Don't let the butter burn!", "When the butter has completely melted (about 2 minutes), REDUCE heat again, to low. STIR in the decarboxylated marijuana. Feel free to add more water if you think the cannabis might rest on the bottom of the pot--you don't want that.", "SIMMER low for 3-6 hours, STIRRING occasionally. It should end up slightly glossy, cloudy, and thick. The cannabis has darkened significantly at this point, and is all floating at the top.", "This is the only hard part. Read the rest of the steps and all the warnings carefully! COVER two large tupperware containers with cheesecloth folded over twice (four layers) OR a mesh nut milk bag. WARNING: Make sure you cover the entire opening with each layer. Wrestling with tangled cheesecloth is not fun. Also, make sure not to use really cheap plastic containers. The cannabutter mixture is hot enough to melt the really cheap ones.", "SECURE the cheesecloth with rubber bands. Make sure the openings are completely covered, and TAP on them to make sure the rubber bands have a good grip. A little give is fine.", "POUR the butter mixture SLOWLY through the cheesecloth into the containers. You can pour about half into each container, you just don't want to overfill. You may want to use your rubber spatula to get every last drop out of the pan. As you finish each one, carefully unband the the cheesecloth/mesh bag and gather it up into a ball, holding the cannabis mess in the middle. Carefully SQUEEZE the extra butter through the cheesecloth into the containers. WARNING: Pour quite slowly, it takes time for the liquid to filter through the cheesecloth and fill the container. Also, when you squeeze, squeeze gently. It's easy to burst the cheesecloth and get cannabis sludge in your butter. (If you do that, you just have to filter it again.)", "Throw away the cheesecloth containing the cannabis.", "Seal your containers and CHILL in the fridge for 8 hours.", "When you take them out, you have a semi-hard layer of butter sitting over a lot of waste water. Hold each container and gently SQUEEZE the sides, creating an opening to DRAIN the water. Once drained, your cannabutter is ready to cook with or freeze!", "BAKING TIPS", "When making cookies, use any recipe you want, but substitute one-third of the butter with cannabutter; i.e. 2 parts regular butter, 1 part cannabutter. At this ratio, for most people one (<1 tbsp) cookie will give you a tolerable, sociable high and two cookies will get you stoned. Obviously, the size of your cookies and your tolerance will affect the outcome. You can get over 200 cookies out of an ounce of weed!" ], "name" : "Cannabutter", "recipeYield" : "210", "tags" : [ "cannabis", "marijuana", "butter", "baking" ], "url" : "cannabutter" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fc6" }, "author" : "Cory Dodt", "ingredients" : [ "5 large carrots, chopped small", "2 onions, chopped small", "2 tsp fresh ginger, minced", "3 tsp curry powder", "3 1/2 cups vegetable broth", "2 15-oz cans lite coconut milk", "Sea salt, to taste", "1 ear sweet corn on the cob" ], "instructions" : [ "Simmer the carrots, onions, ginger, and curry powder in vegetable broth for 20-25 minutes, until carrots are soft.", "Allow to cool slightly. Set aside 1/4 of the vegetables. Puree the rest in a blender, working in batches if needed.", "Return all vegetables to heat and stir in coconut milk until well-combined.", "Season generously with sea salt, to taste.", "Boil water and cook the corn on the cob for 4 minutes. Cut the corn off the cob and stir into the soup.", "Serve hot, or, chill until cold and serve as a gourmet vegetarian and vegan appetizer soup. This carrot soup will thicken as it cools, so if serving this soup cold, you may want to add a bit of extra liquid." ], "name" : "Carrot Soup with Coconut", "recipeYield" : "8", "tags" : [ "soup", "carrot", "coconut", "vegan" ], "url" : "carrot-soup-with-coconut" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fc7" }, "author" : "Cory Dodt", "ingredients" : [ "CREAM", "1 cup cashew pieces, soaked for 1 hour", "2 cups vegetable broth, divided", "PUREE", "1/4 cup warm water", "1 medium yellow onion, chopped", "1 small nub of ginger, peeled, or 1 tsp ginger paste", "4 cloves garlic, crushed", "VEGGIES", "1 lb carrots, peeled, sliced", "1 1/4 lbs Yukon gold potatoes, peeled, chopped into bite-sized pieces", "1 lb cauliflower, chopped into bite-sized pieces", "ETC", "3 tbsp peanut oil, divided", "1 1/2 tsp ground coriander", "1 tsp red pepper flakes", "1 1/2 tsp curry powder", "1 tbsp garam masala", "Ground black pepper", "1 tsp salt", "1 1/2 tsp tamarind concentrate, (substitution: lime juice)", "1 tbsp tomato paste", "12 oz coconut milk", "1 cups frozen peas", "1 small red onion, thinly sliced", "Fresh cilantro, chopped" ], "instructions" : [ "Soak the cashews by placing them in a bowl and submerging them in water for at least an hour. Start other steps.", "Boil veggies in an 8-quart pot, starting them in cold water brought to a boil, covered. Once boiling, reduce heat and simmer for 15 minutes or until potatoes are fork-tender. Drain, set aside.", "Blend water, yellow onion, ginger & garlic into a puree. Some texture is good.", "Preheat half of the oil in another big pot over medium heat. Cook the puree with some salt for 15-20 minutes, until it's brown, stirring frequently. Reduce heat halfway through, as the pot heats up.", "Drain the nuts and puree with 1 cup of the vegetable broth. Blend until smooth.", "Once the puree is mostly browned, add coriander and red pepper flakes. Saute 3 minutes. Add curry powder, garam masala, several dashes fresh black pepper and salt and saute for another 1 minute. Add tamarind (lime), tomato paste, and remaining 1 cup of vegetable broth. Bring to a simmer, then reduce heat to medium-low/low. Add coconut milk and cashew cream. Cook uncovered for 15 minutes. Should be thicker and really creamy.", "Meanwhile, saute the red onion in the remaining peanut oi in a separate pan with a pinch of salt for 15 minutes, or until browned and slightly caramelized.", "Add onion to the boiled vegetables along with the peas. Fold all of the vegetables into the sauce. Put the lid on the pot and let it heat through.", "Taste for salt and seasoning, garnish with cilantro.", "Serve with a side of raita." ], "name" : "Cashew Vegetable Korma", "recipeYield" : "10", "tags" : [ "korma", "indian", "cashew", "vegan", "good" ], "url" : "cashew-vegetable-korma" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fc8" }, "author" : "Cory Dodt", "ingredients" : [ "1/2 cup grated parmesan cheese, (about 2 oz., plus 2 tbsp)", "1/4 cup mayonnaise, plus 2 tbsp", "1/4 cup sour cream, plus 2 tbsp", "1/2 tsp ground black pepper", "1/2 tsp onion salt", "1/2 tsp garlic powder", "Pinch of salt", "2 (14-oz) cans artichoke hearts packed in water, well-drained, chopped into 1/4-inch pieces", "1/4 tsp paprika", "1 cup italian cheese blend", "French bread baguette slices, toasted" ], "instructions" : [ "Preheat oven to 375 degrees F.", "Whisk 1/2 cup grated parmesan cheese, mayonnaise, sour cream, pepper, onion salt, and garlic powder in a medium bowl to blend.", "Stir in chopped artichoke hearts. Transfer mixture to a 3-cup ramekin. Sprinkle the dip with the remaining 2 tbsp grated parmesan cheese, italian cheese, and paprika.", "Bake dip until heated through, about 25 minutes (about 35 minutes if chilled). Preheat broiler. Broil until cheese melts, about 2-3 minutes.", "Serve warm with toasted baguette slices." ], "name" : "Cheesy Baked Artichoke Dip", "tags" : [ "cheese", "artichoke", "appetizer", "dip", "GOOD" ], "url" : "cheesy-baked-artichoke-dip" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fc9" }, "author" : "Cory Dodt", "ingredients" : [ "3 slices ciabatta bread", "1/2 oz cheddar cheese, 3 thin slices", "1 1/2 oz light feta cheese crumbles", "1/3 cup spinach, packed", "1 clove garlic, minced", "3 large eggs", "4 tbsp soyrizo", "1 tbsp olive oil", "2 tbsp butter, divided", "Salt and pepper" ], "instructions" : [ "Heat a skillet or griddle to medium-low heat, and melt 1 tbsp butter. Spread the soyrizo out in a smooth lump on the grill.", "In a small skillet, heat up 1 tbsp olive oil. Roast the garlic in the olive oil for about 30s, until garlic just starts to brown. Stir in spinach leaves and 2-3 tbsp of water. The water should start to boil almost immediately; cover and reduce to low heat. Let simmer for about 4 minutes, stirring once.", "Meanwhile, butter one side of each slice of bread, and drop the un-buttered side onto the hot, buttered skillet. Toast for about 1-2 minutes, checking the bottom frequently to make sure it doesn't burn. Flip the bread, and then crack the eggs over the soyrizo, mixing eggs and soyrizo together while the bread browns on the other side. Add a slice of cheese to each piece of bread, and let it toast for another minutes.", "Place the toasted bread pieces onto a plate. Top with egg mixture, then spinach, then crumbled feta cheese. Salt and pepper to taste." ], "name" : "Cheesy Soyrizo on Toast", "recipeYield" : "3", "tags" : [ "breakfast", "toast", "eggs", "soyrizo", "spinach", "garlic", "GOOD" ], "url" : "cheesy-soyrizo-on-toast" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fca" }, "author" : "Cory Dodt", "ingredients" : [ "1 tbsp olive oil", "1 cup onion, chopped (about half an onion)", "1 cup black olives, chopped", "4 eggs", "1 1/2 cups milk", "2 tbsp all-purpose flour", "1/2 tsp pepper", "1/4 tsp salt", "3 (7-oz) cans whole green chiles, split open", "4 cups cheddar, shredded", "4 cups Monterey Jack cheese, shredded" ], "instructions" : [ "Preheat oven to 350 F.", "Lightly grease a 9x13-inch glass baking dish and set aside.", "Heat the olive oil in a medium skillet on medium-high heat. Saute the onions about 5-7 minutes.", "Beat eggs, milk, flour, salt & pepper in a medium bowl to blend.", "Arrange chiles from 1 can in prepared dish, covering bottom completely. Add 1/3 of the onions and olives. Sprinkle with 1/3 of each cheese. Repeat layering twice. Pour egg mixture over cheese. Let stand 30 minutes. (Can be prepared 1 day ahead. Cover and refrigerate.)", "Bake until casserole is slightly puffed in center and golden brown on edges, about 45 minutes.", "Cool 20 minutes and serve." ], "name" : "Chile Relleno Casserole", "recipeYield" : "8", "tags" : [ "green chiles", "eggs", "olives", "cheese", "casserole", "GOOD" ], "url" : "chile-relleno-casserole" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fcb" }, "author" : "Cory Dodt", "ingredients" : [ "FILLING", "1 cup low-sodium vegetable broth", "2 tsp ground cumin", "3/4 cup couscous", "1 cup garbanzo beans, canned, rinsed and drained", "1/4 cup dried currants", "1 packed cup baby spinach leaves, chopped", "1/2 cup crumbled feta cheese (4 oz)", "1/4 cup extra-virgin olive oil, plus more for drizzling", "Kosher salt and black pepper", "2 medium red bell peppers, try to select peppers that stand up easily on their own base", "1 medium yellow bell pepper", "1 medium orange bell pepper", "Hot water, as needed", "SAUCE", "1 packed cup fresh basil leaves, or 4 tsp squeeze concentrate", "1/2 cup creme fraiche, (about 4 oz), or crema mexicana", "3 tbsp extra-virgin olive oil", "1 tbsp water", "1 clove garlic, coarsely chopped", "2 tsp lemon juice", "1/4 tsp sugar", "1/4 tsp salt, plus extra, as needed", "1/4 tsp black pepper, plus extra, as needed" ], "instructions" : [ "Put an oven rack in the center of the oven. Preheat to 400 F.", "FILLING: In a medium saucepan, bring the vegetable broth and cumin to a boil over medium-high heat. Remove the pan from the heat and stir in the couscous. Cover the pan until the couscous is tender and all of the liquid has been absorbed, about 5-6 minutes. Put the couscous in a large bowl and add the beans, currants, spinach, feta and 1/4 cup olive oil. Season with salt and pepper, to taste. Stir until all the ingredients are combined.", "Slice the tops off the peppers and remove all the ribs and seeds. If necessary, cut a very thin slice from the base to help the peppers stand up. Stuff the peppers with the filling and drizzle the tops with olive oil. Put the peppers in an 8x8-inch square baking dish. Fill the baking dish with 3/4-inch hot water and bake until the filling is golden and the peppers are cooked through, about 55 to 60 minutes. Cooks Note: If the filling begins to brown too quickly, cover the pan with foil.", "SAUCE: In a blender, combine the basil, cream, olive oil, water, garlic, lemon juice, sugar, salt, and pepper. Blend until smooth. Adjust the seasoning with salt and pepper, to taste.", "Remove the peppers from the oven and arrange on serving plates. Spoon the sauce around the peppers and serve." ], "name" : "Couscous-stuffed peppers with Basil Sauce", "recipeYield" : "4", "tags" : [ "couscous", "peppers", "basil", "VEGAN", "GOOD" ], "url" : "couscous-stuffed-peppers-with-basil-sauce" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fcc" }, "author" : "Cory Dodt", "ingredients" : [ "2 tbsp olive oil", "1 large onion, diced", "2 large celery stalks, diced", "1 1/2 pounds slender asparagus", "6 large leeks, white/pale green parts only, chopped, well-rinsed", "2 medium potatoes, peeled, finely diced", "2 vegetable boullion cubes", "1 tsp dried tarragon", "1 tsp dried basil", "1/4 cup chopped parsley", "1 to 1 1/2 cups rice milk", "Salt", "Pepper" ], "instructions" : [ "Heat the oil in a large soup pot. Add the onions and celery and saute over medium heat until the onions are golden.", "Trim about 1 inch from the bottoms of the asparagus stalks and cut them into 2-inch pieces. Set aside the tips, and add the remaining pieces to the soup pot along with the leeks, potatoes, dried herbs, boullion cubes, and just enough stock or water to barely cover.", "Bring to a gentle boil, then lower heat, cover, and simmer until the vegetables are tender, about 20 to 25 minutes.", "Puree the soup in batches and return to the soup pot. Or, simply insert an immersion blender into the pot and puree.", "Return to low heat. Stir in the parsley. Add enough rice milk to give the soup a slightly thick consistency. Season with salt and pepper. Simmer over very low heat for 10 minutes longer. If time allows, let the soup stand for several hours off the heat, or, if making ahead, let cool and refrigerate until needed.", "Just before serving, steam the reserved asparagus tips until bright green and tender-crisp. Stir into the soup, adjust the seasonings, and serve." ], "name" : "Cream of Leek and Asparagus Soup", "recipeYield" : "6", "tags" : [ "soup", "leek", "asparagus", "VEGAN" ], "url" : "cream-of-leek-and-asparagus-soup" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fcd" }, "author" : "Cory Dodt", "ingredients" : [ "3/4 cup uncooked white rice", "2 cups milk, divided", "1/3 cup white sugar", "1/4 tsp salt", "1 egg, beaten", "2/3 cup golden raisins", "1 tbsp butter", "1/2 tsp vanilla extract" ], "instructions" : [ "Bring 1 1/2 cups water to a boil in a saucepan; stir rice into boiling water. Reduce heat to low, cover, and simmer for 20 minutes.", "In a clean saucepan, combine 1 1/2 cups cooked rice, 1 1/2 cups milk, sugar, and salt. Cook over medium heat until thick and creamy, 15 to 20 minutes. Stir in remaining 1/2 cup milk, beaten egg, and raisins; cook 2 minutes more, stirring constantly. Remove from heat and stir in butter and vanilla." ], "name" : "Creamy Rice Pudding", "tags" : [ "dessert", "rice", "pudding", "raisins", "GOOD" ], "url" : "creamy-rice-pudding" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fce" }, "author" : "Cory Dodt", "ingredients" : [ "2 tbsp canola oil", "2 tsp minced garlic", "1/4 cup red curry paste", "1 tbsp dark brown sugar", "2 (13.5-oz) cans light coconut milk", "2 1/2 cups vegetable broth", "1/4 cup lime juice", "1/4 cup ginger, thinly sliced, peeled", "2 tbsp soy sauce", "2 cups carrot, thinly sliced (about 4 carrots)", "1 1/2 cups green beans, 1-inch pieces", "1 (14-oz) package water-packed soft tofu, drained, cut into 1-inch cubes", "3/4 cup clinatro leaves" ], "instructions" : [ "Heat oil in a large saucepan over medium-high heat.", "Add garlic to pan; saute 30 seconds or until lightly browned.", "Add curry paste; saute 1 minute, stirring constantly.", "Add brown sugar; saute 1 minute, stirring constantly.", "Stir in coconut milk, broth, juice, ginger, and soy sauce.", "Reduce heat to low; cover and simmer 1 hour.", "Add carrot; cook for 6 minutes.", "Add beans, and cook 4 minutes or until vegtables are crisp-tender.", "Add tofu to pan, and cook 2 minutes.", "Garnish with cilantro leaves." ], "name" : "Fiery Tofu and Coconut Curry", "recipeYield" : "6", "tags" : [ "tofu", "curry", "soup", "coconut", "vegan" ], "url" : "fiery-tofu-and-coconut-curry" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fcf" }, "author" : "Cory Dodt", "ingredients" : [ "2 tbsp teriyaki sauce", "2 tbsp soy sauce", "2 tbsp wine vinegar", "4 tsp ground ginger", "2 stalks celery, diced", "1 carrot, diced", "1/2 cup snow peas", "1/2 onion, diced", "4 scallions, sliced", "3 tbsp olive oil, divided", "1 tbsp sesame oil", "1 pound lo mein or Chinese-style noodles" ], "instructions" : [ "Whisk together the teriyaki sauce, soy sauce, vinegar and ginger. Set aside.", "Cook the lo mein noodles until soft, about 6-8 minutes, then drain well.", "In a large skillet or wok, saute the vegetables in 2 tbsp of the olive oil for 3-5 minutes, or just until tender.", "Add remaining oil and the teriyaki and soy sauce mixture to the skillet, then add the lo mein noodles. Allow to cook for another 5-7 minutes, stirring frequently and adding more moisture if needed." ], "name" : "Ginger Lo Mein", "tags" : [ "lo mein", "noodles", "ginger", "VEGAN" ], "url" : "ginger-lo-mein" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fd0" }, "author" : "Cory Dodt", "ingredients" : [ "2 1/2 cups all-purpose flour", "1/2 tsp salt", "3/4 tsp baking soda", "1 cup unsalted butter, softened (room temperature, no warmer!)", "3/4 cup granulated sugar", "3/4 cup brown sugar, firmly packed", "2 large eggs", "1 tsp vanilla extract", "2 cups heath english toffee bits" ], "instructions" : [ "In a small bowl, whisk together flour, salt, and baking soda, and set aside. In a large bowl, beat the softened butter with both sugars, on medium speed of an electric mixer, until smooth and fluffy, about 2-3 minutes. Add eggs, one at a time, beating well after each addition, then beat in the vanilla. Gradually add dry ingredients to sugar mixture, beating at low speed, just until well-combined. Fold in chopped Heath bar pieces.", "Chill cookie dough for at least 30 minutes, up to overnight.", "Preheat oven to 350 F. Line cookie sheets with parchment paper.", "Drop cookie dough by rounded tablespoons, 3 inches apart, onto prepared cookie sheets (these cookies spread a bit more than regular chocolate chip cookies). Bake until the edges are just starting to brown, about 10-11 minutes. Do not over-bake (cookies will appear soft and moist, and a little puffed-up, which will drop as they cool).", "Remove from oven and let cool for 2-3 minutes on the cookie sheets before removing to wire racks to cool completely." ], "name" : "Heath Bar Cookies", "recipeYield" : "36 cookies", "tags" : [ "cookie", "dessert", "heath bar", "toffee", "GOOD" ], "url" : "heath-bar-cookies" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fd1" }, "author" : "Cory Dodt", "ingredients" : [ "2 pie crusts, prepared according to pie crust recipe.", "1 (8-oz) package neufchatel cheese, softened", "5 tbsp lemon juice, divided", "1 1/2 tsp grated lemon peel, divided", "6 tbsp powdered sugar", "1/2 cup honey", "1/2 cup raisins", "5 medium d'anjou or Bartlett pears, ripened completely, peeled, cut into 16 slices each", "1/2 cup sugar", "6 tbsp all-purpose flour", "3/4 tsp ground ginger", "1/4 tsp salt" ], "instructions" : [ "PREPARE recipe for pie crust, using a 9-inch pie plate.", "HEAT oven to 425 F.", "BEAT neufchatel cheese at low speed of an electric mixer until fluffy and smooth. Add 2 tbsp lemon juice, 1/2 tsp lemon peel and powdered sugar. Beat at low speed until blended. Cover and refrigerate.", "COMBINE honey and 3 tbsp lemon juice in small saucepan. Beat with a fork until blended. Add raisins and 1 tsp lemon peel. Bring to a boil on medium-high heat. Reduce heat to low. Cover and simmer 10 minutes.", "PLACE pears in a large bowl. Combine sugar, flour, ginger and salt. Add to pears. Toss to mix. Pour honey mixture over the pears. Toss to mix.", "You may prepare the pear mixture and the cream cheese mixture in advance, and keep them in the fridge overnight.", "SPREAD cheese layer in the unbaked pie crust. Spoon filling into pie crust. Moisten pastry edge with water.", "ROLL out dough for top crust, place onto filled pie and finish edges according to pie crust recipe directions. Cut slits in top crust or prick with a fork to vent steam.", "BAKE at 425 F for 15 minutes. REDUCE OVEN TEMPERATURE TO 350 F. Bake 40-50 minutes or until filling in center is bubbly and crust is golden brown. Cover edge with foil, if necessary, to prevent overbrowning. Cool to room temperature before serving." ], "name" : "Honeyed Cream Cheese Pear Pie", "recipeYield" : "8 slices", "tags" : [ "dessert", "pie", "pear", "cream cheese" ], "url" : "honeyed-cream-cheese-pear-pie" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fd2" }, "author" : "Cory Dodt", "ingredients" : [ "1 1/2 cup uncooked rice", "1 cup milk, (vegan: optional)", "1/2 tbsp ground cinnamon", "1/4 cup stevia sugar blend", "1 tbsp vanilla", "8 oz Bailey's Irish Cream", "8 oz Captain Morgan Black rum, or other spiced rum", "1 tbsp high-proof vodka (100+)" ], "instructions" : [ "Put rice in a blender with 7 cups water. Blend until rice is breaking up, about 2 minutes.", "Let stand for at least 3 hours.", "Strain rice water into a pitcher and discard the rice.", "Stir in milk, cinnamon, vanilla, and sugar. Chill.", "-- for each drink --", "Put a thin layer of vodka on the bottom of a lowball or old fashioned glass. Light with a long-stemmed lighter and don't freak out. Sprinkle cinnamon into the flame, whoosh! Then cover briefly to douse.", "Fill halfway with ice. Add 1 oz rum and 1 oz Bailey's, then fill to the top of the ice with horchata.", "Garnish with cinnamon sprinkled on top." ], "name" : "Horchata Loca", "recipeYield" : "8 drinks", "tags" : [ "beverage", "alcohol", "horchata", "rum", "Baileys" ], "url" : "horchata-loca" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fd3" }, "author" : "Cory Dodt", "ingredients" : [ "6 1/2 tbsp butter, divided", "2 medium (8-oz) onions, diced", "2 cloves garlic, minced", "16 oz mushrooms (cremini/white button), chopped", "3 tbsp paprika", "6 tsp fresh dill, chopped (or 3 tsp dried dill)", "1 1/2 tsp sea salt", "1/2 tsp black fresh ground pepper", "3 tbsp flour", "1 1/2 cup whole milk", "3 cups vegetable broth", "3/4 cup sour cream", "Parsley, chopped, for garnish", "Extra sour cream, for garnish" ], "instructions" : [ "Melt 2 tbsp butter in 10\" skillet. Saute onions until translucent just barely beginning to brown. Add garlic and saute for another minute. Add mushrooms and saute for 5 minutes until the mushrooms release juices. Add the paprika, dill, salt and pepper. Set aside.", "In a stock pot, melt 4.5 tbsp butter and stir in flour, constantly whisking for several minutes until the mixture is rich caramelized brown. Add milk and broth while whisking until the mixture is smooth. Add mushroom mixture. Bring to a boi, reduce heat to medium-low, cover and simmer for 15 minutes, stirring occasionally.Stir in sour cream, simmer for another 2 minutes. Serve immediately with chopped parsley. Add a dollop of sour cream to each bowl if desired.", "Served with crusty bread. (Sandwich pairing: Focaccia bread with roast beef, tomatoes, lettuce, and Havarti cheese.)", "*** Alternatively, thicken the soup with a little more flour and serve over hot egg noodles." ], "name" : "Hungarian Mushroom Soup", "recipeYield" : "6", "tags" : [ "monte", "soup", "mushroom", "hungarian", "GOOD" ], "url" : "hungarian-mushroom-soup" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fd4" }, "author" : "Cory Dodt", "ingredients" : [ "5 or 6 cups vegetable broth", "2 tbsp olive oil", "12 oz fettuccine", "8 oz fresh spinash", "2 pounds tomatoes, diced", "1 medium onion, thinly sliced", "4 cloves garlic, thinly sliced", "1 tbsp dried basil", "1 tbsp dried oregano", "1/2 tsp red pepper flakes", "Freshly cracked pepper, to taste", "2 oz light feta cheese, (vegan: optional)" ], "instructions" : [ "Add four cups of the vegetable broth to a large pot. Break the fettuccine in half, and add it to the pot. Also add the tomatoes, olive oil, frozen spinach, onion, garlic, basil, oregano, red pepper, and some freshly cracked black pepper.", "Make sure the ingredients are submerged under the liquid, adding an additional cup of broth, if the ingredients are not fully covered. Place a lid on top of the pot, and then turn the heat on to high. Allow the pot to come to a full, rolling boil over high heat, then remove the lid and turn the heat down to medium.", "Allow the pot to continue to boil over medium heat without a lid, for 15-20 minutes, or until the pasta is cooked and most of the liquid has been absorbed. Stir the pot every few minutes as it cooks to prevent the pasta from sticking to the bottom, but avoid over-stirring which can cause the paste to become sticky and mushy. The pot must be boiling the entire time. You may wish to add a final cup of broth if the ingredients aren't submerged at the halfway mark.", "After the pasta is cooked, crumble the feta cheese over the top and serve." ], "name" : "Italian Wonderpot", "recipeYield" : "8", "tags" : [ "pasta", "fettuccine", "tomatoes", "garlic", "GOOD", "VEGAN" ], "url" : "italian-wonderpot" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fd5" }, "author" : "Cory Dodt", "ingredients" : [ "1 (16-oz) can chickpeas, drained and rinsed", "1/4 cup tahini", "1/4 cup lemon juice", "1/6 cup olive oil or peanut oil", "1/2 tsp salt", "1/2 tsp ground cumin", "2-3 cloves garlic, minced", "3 scallions, chopped", "1 whole green chile, chopped (optional)", "2 oz sun-dried tomatoes, completely drained, chopped (optional)", "3 tbsp water", "Paprika" ], "instructions" : [ "Combine chickpeas, lemon juice, and tahini in a blender and blend for 2 minutes.", "Add oil, salt, cumin, and garlic, and blend for 1 minute.", "Add the scallions, chile, and sun-dried tomatoes and continue to blend, slowly adding water to get the right smooth consistency.", "Sprinkle with paprika and drizzle with olive oil before serving." ], "name" : "Hummus", "recipeYield" : "12", "tags" : [ "hummus", "vegan" ], "url" : "hummus" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fd6" }, "author" : "Cory Dodt", "ingredients" : [ "2 large eggs", "1 3/4 cups whole milk", "2 1/2 cups all-purpose flour", "2 tbsp sugar", "2 tsp baking powder", "2 tsp salt", "4 tbsp unsalted butter, melted" ], "instructions" : [ "Beat the eggs until frothy in a large bowl. Whisk in the milk.", "In a separate bowl, sift together the flour, sugar, baking powder and salt. Add the egg mixture to the dry mixture. Stir until well-incorporated, then stir in the butter. The batter should be fairly smooth with a few small lumps." ], "name" : "Just pancake batter", "recipeYield" : "6 large pancakes", "tags" : [ "pancake", "batter", "breakfast" ], "url" : "just-pancake-batter" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fd7" }, "author" : "Cory Dodt", "ingredients" : [ "1 large bunch fresh basil leaves, washed and air-dried", "3 medium cloves garlic", "1 medium handful pine nuts", "1/2 cup parmesan cheese, fresh-grated and packed", "1/4 cup asiago cheese, fresh-grated and packed", "2-3 tbsp extra-virgin olive oil" ], "instructions" : [ "Chop garlic, nuts and basil leaves until loosely chopped.", "Gradually add all ingredients to a mortar and grind with a pestle, adding more ingredients in small handfuls until completely ground into a cake.", "Place the cake in a small bowl.", "Cover with olive oil.", "Can-store in a refrigerator. Always stir before using." ], "name" : "Just pesto", "recipeYield" : "4 (2-oz) servings", "tags" : [ "pesto", "GOOD" ], "url" : "just-pesto" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fd8" }, "author" : "Cory Dodt", "ingredients" : [ "3/4 cup fat-free greek yogurt", "1/2 cup english hothouse cucumber, chopped, seeded", "2 tbsp fresh cilantro, chopped", "2 tsp green onions, chopped", "1/4 tsp ground coriander", "1/4 tsp ground cumin", "Salt" ], "instructions" : [ "Mix all ingredients in a medium bowl. Season to taste with salt. Chill raita, covered, until ready to serve." ], "name" : "Just raita", "recipeYield" : "10 (2-tbsp) servings", "tags" : [ "raita", "yogurt", "cucumber" ], "url" : "just-raita" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fd9" }, "author" : "Cory Dodt", "ingredients" : [ "8 oz asparagus, trimmed and cut into 1-inch pieces", "8 oz sugar snap peas, trimmed and cut in half", "5 tsp extra-virgin olive oil, divided", "1 (8-oz) zucchini, halved lengthwise and cut into 1/2-inch-thick slices", "1 (8-oz) yellow squash, halved lengthwise and cut into 1/2-inch thick slices", "4 3/4 cups vegetable broth", "1/2 cup shallots, finely chopped", "1 cup arborio rice, uncooked", "1/4 cup dry white wine", "1/2 cup fresh pecorino Romano cheese, (about 2 oz), grated", "1/4 cup fresh chives, chopped", "1 tsp lemon zest", "2 tbsp fresh lemon juice", "1 tbsp unsalted butter, (vegan: margarine)", "1/4 tsp salt" ], "instructions" : [ "Bring a large saucepan of water to a boil. Add asparagus and peas; cook for 3 minutes or until crisp-tender. Drain and rinse under cold water.", "Heat a large nonstick skillet over medium-high heat. Add 2 tsp olive oil to pan; swirl to coat. Add zucchini and squash to pan; cook for 7 minutes or until lightly browned, stirring occasionally. Set aside.", "Bring vegetable broth to a simmer in a medium saucepan (do not boil). Keep warm over low heat.", "Heat remaining 1 tbsp olive oil in a dutch oven over medium heat. Add shallots, and cook for 3 minutes or until tender. Stir in rice, and cook for 1 minute, stirring constantly. Stir in wine; cook until liquid is absorbed (about 30 seconds), stirring constantly. Stir in 1 cup broth; cook 5 minutes or until liquid is nearly absorbed, stirring constantly. Reserve 1/4 cup broth. add remaining broth, 1/2 cup at a time, stirring constantly, until each portion of the broth is absorbed before adding the next (about 22 mintues total). Stir in vegetables; cook 1 minute or until thoroughly heated. Remove from heat; stir in reserved 1/4 cup broth and remaining ingredients." ], "name" : "Summer Lemon-Vegetable Risotto", "recipeYield" : "6", "tags" : [ "risotto", "rice", "lemon", "GOOD" ], "url" : "summer-lemon-vegetable-risotto" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fda" }, "author" : "Cory Dodt", "ingredients" : [ "1 1/2 tbsp olive oil", "1 1/2 cups zucchini, about 1 zucchini, diced", "1 cup red bell pepper, chopped", "2/3 cup white onion, chopped", "2 tbsp fresh thyme, chopped", "1/2 tsp salt, divided", "1/4 tsp freshly-ground black pepper, divided", "3 cloves garlic, minced", "1 cup tomato, chopped, seeded", "12 large eggs" ], "instructions" : [ "Heat olive oil in a 10-inch nonstick broiler-proof skillet over medium heat. Add zucchini, bell pepper, onion, thyme, 1/4 tsp salt, 1/8 tsp black pepper, and garlic. Cover and cook 7 minutes or until vegetables are tender, stirring occasionally. Stir in tomato. Cook, uncovered, for 5 minutes or until liquid evaporates.", "Combine eggs, remaining 1/4 tsp salt, and remaining 1/8 tsp black pepper in a medium bowl; stir with a whisk until frothy. Pour egg mixture into pan over vegetables, stirring gently. Cover, reduce heat, and cook 15 minutes or until almost set in the center.", "Preheat broiler.", "Broil frittata 3 minutes or until set. Invert onto a serving platter; cut into 8 wedges." ], "name" : "Summer Vegetable Frittata", "recipeYield" : "12", "tags" : [ "frittata", "eggs", "peppers", "GOOD" ], "url" : "summer-vegetable-frittata" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fdb" }, "author" : "Cory Dodt", "ingredients" : [ "1 tbsp olive oil", "1 head green garlic, minced, with some sliced green stem", "1 green garlic scape, sliced thin", "2 medium yams, diced (about 3 cups)", "1/2 cup water", "1 large bunch kale, chopped (about 2 cups)", "1/2 tsp salt", "1/2 tsp black pepper", "8 medium eggs, lightly whisked", "2 oz light feta cheese", "" ], "instructions" : [ "In an OVEN-SAFE sautee pan, heat the oil on medium heat, then toss in the green garlic and yams. Sautee together for about 5 minutes. Add the half cup of water to the pan, and bring the water to a boil, then reduce heat to medium-low, and cover. Cook covered until the yams are soft, about 5 additional minutes.", "Meanwhile, preheat oven to broil, and", "Mix together the lightly scrambled eggs, feta cheese, salt and pepper.", "Stir the chopped kale into the pan and heat for about 5 minutes.", "Pour the egg mixture into the pan cover, and tilt the pan around gently to spread the contents evenly. Cook 5-7 additional minutes, until a thick firm eggy edge has formed.", "Take the pan out of the oven and place it in the broiler. Broil until the cheese is melted and the eggs are firm and slightly crispy-looking. They might be light brown at this point.", "Serve with bread." ], "name" : "Kale Yam Frittata", "recipeYield" : "8", "tags" : [ "kale", "yam", "eggs", "frittata" ], "url" : "kale-yam-frittata" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fdc" }, "author" : "Cory Dodt", "ingredients" : [ "1 1/4 cups all-purpose flour", "3 tbsp yellow cornmeal", "2 tsp baking powder", "1 tsp pumpkin pie spice", "1/4 tsp salt", "1/2 tsp ground cinnamon", "1/4 cup pecans, finely chopped, toasted, divided", "1 cup milk", "1 cup sweet potato, cooked, mashed", "3 tbsp brown sugar", "1 tbsp canola oil", "1/2 tsp vanilla extract", "2 large eggs, separated into yolks and whites", "2 fl oz stevia simple syrup", "Cooking spray" ], "instructions" : [ "Lightly spoon all-purpose flour into dry measuring cups; level with a knife. Combine flour and the next 5 ingredients (through cinnamon)--plus half of the pecans--in a large bowl, stirring with a whisk.", "Combine milk, sweet potato, sugar, oil, vanilla, and egg yolks, stirring until smooth; add to flour mixture, stirring just until combined. Beat egg whites with a mixer at high speed until soft peaks form; fold egg whites into batter. Let the batter stand for 10 minutes (and no more than 10). Mix in simple syrup to thin the batter.", "Heat a nonstick griddle or nonsticket skillet over medium-high heat. Coat griddle or pan with cooking spray. Spoon about 1/4 cup batter per pancake onto the grill. Cook 2 minutes or until tops are covered with bubbles and the edges look cooked. Carefully turn pancakes over, and cook 2 minutes or until bottoms are lightly browned. Garnish with remaining pecans." ], "name" : "Sweet Potato and Pecan Pancakes", "recipeYield" : "8 pancakes", "tags" : [ "pancake", "breakfast", "pecan", "sweet potato" ], "url" : "sweet-potato-and-pecan-pancakes" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fdd" }, "author" : "Cory Dodt", "ingredients" : [ "1 sheet frozen puff pastry (half a 17-oz package)", "1/2 cup pesto", "1 cup (4 oz) shredded mozzarella", "8 oz whole tomatoes, peeled,  cut into 1/4-inch thick slices", "Fresh basil" ], "instructions" : [ "Defrost puff pastry sheets at least one hour beforehand.", "Preheat oven to 400F.", "Grease a baking sheet with butter and set aside.", "Unfold puff pastry onto lightly-floured surface. Roll into 12-in square; crimp edges; place on prepared baking sheet.", "Spread pesto evenly over pastry. Sprinkle with 1/2 cup cheese. Add tomato slices in a single layer. Finish by topping evenly with cheese.", "Bake 17-20 minutes until golden brown.", "Garnish with basil.", "Cut into 8 pieces." ], "name" : "Tomato Pesto Pastries", "recipeYield" : "4", "tags" : [ "monte", "pesto", "tomatoes", "tart", "good" ], "url" : "tomato-pesto-pastries" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fde" }, "author" : "sally", "cookTime" : "sally", "ingredients" : [ "1 pound penne pasta, uncooked", "2 tbsp extra virgin olive oil", "7 oz vegetarian ground sausage", "4 cloves garlic, minced", "1/2 tsp crushed red pepper flakes", "1 (28-oz) can crushed tomatoes", "3/4 tsp salt", "2 tbsp vodka", "1/2 cup heavy whipping cream", "1/4 cup chopped fresh parsley", "2 oz grated parmesan cheese" ], "instructions" : [ "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8-10 minutes or until al dente; drain.", "In large skillet, heat oil over moderate heat. Add sausage substitute to skillet. Cook, breaking up the sausage substitute, until brown. Add garlic and red pepper and cook, stirring until garlic is golden brown.", "Add tomatoes and salt; bring to a boil. Reduce heat and simmer 15 minutes.", "Add vodka and cream and bring to a boil. Reduce heat to low and add pasta; toss for 1 minute. Stir in fresh parsley and serve.", "Garnish with parmesan cheese." ], "name" : "sally", "prepTime" : "None", "recipeYield" : "8", "tags" : [ "penne", "vodka", "pasta", "cream", "GOOD" ], "url" : "vodka-tomato-cream-penne-with-sausage" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fdf" }, "author" : "Cory Dodt", "ingredients" : [ "6 cups hot water", "4 cups whiskey", "2 cups unsweetened tea, freshly brewed and boiling hot", "1 (12-oz) can frozen lemonade", "1 small (6-oz) can frozen orange juice", "1 cup sugar" ], "instructions" : [ "Combine the ingredients and mix thoroughly.", "Freeze for 24 hours." ], "name" : "Whiskey Sour Slush", "recipeYield" : "2 gallons", "tags" : [ "whiskey", "beverage", "alcohol", "orange juice" ], "url" : "whiskey-sour-slush" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fe0" }, "author" : "Cory Dodt", "ingredients" : [ "1 cup butter, room temperature", "1 cup light brown sugar", "1/2 cup granulated sugar", "3 eggs", "1 1/2 tbsp vanilla extract", "1 tsp kosher salt", "1 tsp baking soda", "1 tsp baking powder", "2 1/2 cups flour", "1 (12-oz) bag white chocolate chips" ], "instructions" : [ "TOO MELTY--MORE WHITE CHOCOLATE (20oz in original recipe?) Less leavening?", "In bowl of stand mixer cream together butter and both sugars for 2 minutes in medium speed.", "Turn speed to low and add in eggs and vanilla. Turn mixer back up to medium and beat until smooth, about 20 seconds.", "Turn mixer back to low and add in salt, baking soda, baking powder and flour, mixing until just combined.", "Fold in white chocolate.", "Chill dough for 24-36 hours.", "When ready to bake, preheat oven to 375.", "Line baking sheet with parchment paper and form dough into heaping tbsp size balls, placing 2 inches apart on a baking sheet.", "Bake for 6-8 minutes until golden around the edges. Don't overbake.", "Allow to cool on baking sheet for 3-5 minutes before transferring to wire rack to finish cooling.", "In between batches, keep dough in the refrigerator." ], "name" : "White Chocolate Chip Cookies", "recipeYield" : "36 cookies", "tags" : [ "cookie", "dessert", "white chocolate" ], "url" : "white-chocolate-chip-cookies" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fe1" }, "author" : "Cory Dodt", "ingredients" : [ "2 large white potatoes, peeled, sliced", "2 tomatoes, chopped", "1 tbsp cumin seed", "1/4 cup vegetable oil", "1 tsp red chili powder", "1 tsp turmeric powder", "Salt, to taste" ], "instructions" : [ "Rinse the potatoes but do not dry them--leave some water.", "In a medium saucepan add oil and cumin seed, and cook on medium-high heat until the seeds turn brown.", "Add potatoes, tomatoes, chili powder, turmeric, and salt.", "Simmer for 30 minutes, stirring several times. Most of the water should evaporate and it will thicken.", "Cover, remove from heat, and let stand 2-3 minutes.", "Serve with naan." ], "name" : "Zeera Ke Aloo", "tags" : [ "monte", "potatoes", "indian" ], "url" : "zeera-ke-aloo" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fe2" }, "author" : "Cory Dodt", "ingredients" : [ "FOR THE CRISPY NOODLES:", "Vegetable oil, for frying", "1 big handful of yakisoba or egg noodles", "", "FOR THE SAUCE:", "4 tbsp flour", "28 oz extra-firm tofu, cut into 1/2-inch cubes", "1/4 cup shallot, thinly sliced", "3 (13.6-oz) cans coconut milk", "2 tbsp curry paste", "1/2 cup light soy sauce", "2 tbsp sugar", "Kosher salt", "1 cup water", "", "TO COMPLETE THE DISH:", "1 cup Chinese pickled mustard greens or marinated artichoke hearts", "1 pound of yakisoba or egg noodles", "4 key limes, halved, or 2 regular limes, quartered", "Fresh cilantro leaves" ], "instructions" : [ "Start a large pot of water boiling.", "Preheat oven to 200 F.", "FOR THE CRISPY NOODLES:", "In a very small saucepan, heat 1/2 inch of vegetable oil over medium-high heat. Throw in one noodle, and when it sizzles, add half of the noodles that you have set aside for crisping. Cook, turning frequently with tongs, until golden-brown and crispy--less than 60 seconds. Remove to a paper towel-lined plate and repeat with the rest of the noodles to be crisped.", "", "FOR THE SAUCE:", "Place serving bowls in 200-degree oven to warm them.", "In a large skillet, heat 2 tbsp vegetable oil over medium-high heat.", "In a bag, toss together the cubed tofu and flour. Shake until tofu is coated. Throw in 1/4 cup of shallots with the tofu and fry 6 minutes in the skillet, stirring occasionally, and set aside.", "Pour 1 can of the coconut milk into a large saucepan (at least 4 quarts), place it over medium heat, and simmer until it begins to separate. Stir in about half of the curry paste, and the soy sauce and sugar, and continue cooking until the sauce becomes thick enough to coat a spoon, about 10 minutes. Add the fried tofu and shallots and simmer 10 more minutes. Taste and adjust seasoning.", "Add the remaining 2 cans of coconut milk and the water, and bring back up to a simmer.", "TO COMPLETE THE DISH:", "Drain and squeeze most of the liquid out of the pickled vegetable.", "Boil the noodles al dente. Drain and divide among the serving bowls.", "Top each serving of noodles with sauce, a squeeze of lime juice, a handful of the pickled vegetable, a hanfdul of the crispy noodles, and a few cilantro leaves. Serve immediately, passing the remaining limes and curry paste." ], "name" : "Khao Soi with Tofu", "recipeYield" : "8", "tags" : [ "thai", "noodles", "tofu", "asian", "GOOD" ], "url" : "khao-soi-with-tofu" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fe3" }, "author" : "Cory Dodt", "ingredients" : [ "5 whole large dried chilies (such as pasilla, ancho, or New Mexico), stemmed but not seeded", "1/4 cup shallot, diced", "2 tsp fresh ginger, grated, or 1 tsp squeeze ginger paste", "1 clove garlic, peeled and sliced", "1/2 tsp coriander seed", "1 tsp ground turmeric", "2 tsp garam masala" ], "instructions" : [ "Dry-toast the chilies in a medium skillet for 2 minutes.", "Add the shallot, ginger, garlic, and continue to cook, tossing once or twice, until the chilies are very gragrant but not burning. Add the coriander seeds, turmeric, and garam masala, toss to combine, and remove from the heat. Let cool slightly.", "Puree with a mortar and pestle, adding about 1/4 cup of water (or more as needed) to form a coarse paste." ], "name" : "Thai Curry Paste", "recipeYield" : "8", "tags" : [ "thai", "curry", "paste", "spicy" ], "url" : "thai-curry-paste" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fe4" }, "author" : "Cory Dodt", "ingredients" : [ "2 tbsp olive oil", "2 onions, chopped", "6 cloves garlic, minced", "2 carrots, roughly grated", "12 cups vegetable broth", "1 1/2 cup orzo pasta", "1 lemon, zest and juice", "1 tsp salt", "1/2 tsp pepper", "2 tsp dried basil" ], "instructions" : [ "In a large pot, heat olive oil.", "Add in garlic and onion. Saute until translucent.", "Add in carrot. Saute for just a few minutes.", "Pour in vegetable broth. Season with salt and pepper.", "Add orzo. Cook until tender with a slight bite.", "Squeeze in juice of lemon and add zest.", "Season with salt, pepper and basil.", "Let simmer and adjust seasonings if needed." ], "name" : "Lemon Garlic Orzo Soup", "recipeYield" : "8", "tags" : [ "soup", "lemon", "orzo", "VEGAN", "GOOD" ], "url" : "lemon-garlic-orzo-soup" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fe5" }, "author" : "Cory Dodt", "ingredients" : [ "1 oz Scotch or Irish Whiskey", "1 oz Triple Sec", "1 oz Sour Mix", "4 oz Sprite Zero", "1 oz simple syrup or Stevia simple syrup", "1 cherry", "1 slice lemon" ], "instructions" : [ "Shake liquid ingredients; strain into a collins glass", "Garnish with lemon slice and a cherry", "164 kCal" ], "name" : "Lynchburg Lemonade", "recipeYield" : "1 drink", "tags" : [ "beverage", "alcohol", "lemonade", "whiskey", "VEGAN" ], "url" : "lynchburg-lemonade" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fe6" }, "author" : "Cory Dodt", "ingredients" : [ "BLUEBERRY COMPOTE", "1/2 cup Maker's Mark Bourbon", "1/4 cup granulated sugar", "3 tbsp fresh lemon juice", "3 cups fresh blueberries", "Pinch salt", "", "NAUGHTY SYRUP", "2 tbsp Marker's Mark Bourbon", "1 cup Grade A or Grade B maple syrup", "2 sticks cinnamon", "2 tsp whole cloves", "1 piece fresh orange peel, 1\"x3\"", "2 tbsp unsalted butter", "", "PANCAKE STACK", "2 large eggs", "2 cups whole milk", "2 cups all-purpose flour", "2 tbs granulated sugar", "2 tbsp baking powder", "2 tsp salt", "4 tbsp unsalted butter, melted", "1 jar marshmallow cream (Fluff)", "1 recipe bourbon blueberry compote", "1 recipe Naughty Syrup", "Butter for making pancakes", "Granulated sugar" ], "instructions" : [ "BOURBON BLUEBERRY COMPOTE (3 cups)", "Combine 6 tbsp of the bourbon with the sugar and heat over medium heat, stirring until the sugar dissolves completely.", "Add the berries and cook until they start breaking down and the mixture thickens slightly, about 15 minutes.", "Remove from the heat and allow to cool for 4 minutes. Stir in the remaining bourbon and lemon juice.", "", "NAUGHTY SYRUP (1 1/4 cups)", "Combine the maple syrup, cinnamon, clove and orange peel in a small sauce pan. Heat over medium high heat to a simmer then remove from the heat and allow the syrup and aromatics to steep for 20 minutes. Strain the syrup through a fine mesh sieve into a small saucepan.", "Gently warm the syrup over low heat. Add the butter and Maker's Mark Bourbon and stir until well-blended. Serve warm.", "", "PANCAKE STACK (8-12 pancakes)", "Beat the eggs until frothy in a large bowl. Whisk in the milk.", "In a separate bowl, sift together the flour, sugar, baking powder and salt. Add the egg mixture to the dry mixture. Stir until well-incorporated, then stir in the butter. The batter should be fairly smooth with a few small lumps.", "Heat a large griddle or non-stick skillet over medium-high heat. Add a tsp of butter to the hot griddle and then spoon 1/2 cup of batter to form a pancake 5\"-6\" in diameter. Cook the pancake until bubbles stop forming and the batter begins to set, then flip the pancake (the cooked side should be a deep golden brown). Cook until the other side is set and golden brown. Remove the pancake and set aside on a baking sheet or plate, tented with aluminum foil to keep the pancakes warm. Wipe the griddle/pan down in between with a damp towel or paper towel.", "Repeat with the melted butter and remaining batter until all of the batter has been used. The griddle may get hot over time, so adjust and lower the heat as necessary.", "To make a pancake stack, place a pancake on a plate and top that pancake with a few tablespoons of marshmallow cream.", "Add a third pancake to the stack. Brush generously with melted butter and then sprinkle the top pancake with a thin, even layer of granulated sugar. Melt the sugar using a hand torch, keeping the torch 6-8 inches away and in constant motion, to melt the sugar evenly without burning it. When the sugar hardens it will form a deep amber brown crust.", "Top the pancake stack with the Bourbon Blueberry Compote and then drizzle generously with Naughty Syrup. Serve immediately!" ], "name" : "Maker's Mark Morning After Pancake Stack", "recipeYield" : "4", "tags" : [ "breakfast", "syrup", "bourbon", "pancakes" ], "url" : "maker-s-mark-morning-after-pancake-stack" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fe7" }, "author" : "Cory Dodt", "ingredients" : [ "1 1/2 cups red lentils, thoroughly rinsed", "4 cups vegetable stock", "2 tomatoes, diced", "1 tsp salt", "1 tbsp extra virgin olive oil", "1 tsp mustard seeds", "1 tsp cumin seeds", "2 green chilis, chopped (use more or less and discard seeds according to heat preference)", "1 tsp fresh ginger, chopped", "1 clove fresh garlic, chopped", "1/2 cup onion, finely chopped", "1/2 tsp asaefoetida (aka hing)", "2 tsp ground coriander", "1/2 tsp turmeric", "1 pinch kashmiri chili powder (or cayenne pepper)", "1 pinch cinnamon", "1 pinch cloves", "Juice of one lime, (about 3-4 tsp)", "Fresh cilantro, chopped, for serving", "Salt, to taste" ], "instructions" : [ "DAL", "Place rinsed lentils, vegetable stock, tomatoes, and salt in a stock pot.", "CHAUNK", "**Keep the skillet lid handy.** Heat oil in a small skillet over medium heat and add mustard and cumin seeds. Fry until mustard seeds begin to pop, about 10 seconds. Reduce the heat to medium and add chilies, garlic, and ginger. Fry for another 20 seconds.", "Add onion and fry until soft and a light caramelized brown, about 5-7 minutes.", "Add turmeric chili powder, asaefoetida, coriander, cinnamon and cloves and stir to combine.", "Combine the Dal and Chaunk: Scrape contents of the skillet into the stock pot. Stir to combine and bring to a boil. Reduce the heat, cover and simmer for about 20 minutes, or until lentils are done (the soup is a thick consistency), stirring occasionally.", "Before serving, add lime juice, a little at a time, according to taste. Add more salt as needed. Serve sprinkled with fresh-chopped ciantro.", "Serve with some fresh naan bread." ], "name" : "Masoor Dal", "recipeYield" : "4", "tags" : [ "monte", "soup", "indian", "dal", "GOOD", "VEGAN" ], "url" : "masoor-dal" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fe8" }, "author" : "Cory Dodt", "ingredients" : [ "1 pound spaghetti", "1 cup butter", "3/4 pound Mizithra cheese, grated" ], "instructions" : [ "Cook paste in a large pot of boiling water until al dente. Drain.", "When pasta is almost done, start slowly melting butter over medium heat until golden. Skim butter solids off top. Toss pasta with butter. ", "Sprinkle with cheese to taste." ], "name" : "Mizithra Browned Butter Pasta", "recipeYield" : "6", "tags" : [ "mizithra", "spaghetti", "butter" ], "url" : "mizithra-browned-butter-pasta" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fe9" }, "author" : "Cory Dodt", "ingredients" : [ "1 (1/4-oz) package active dry yeast", "1 cup warm water", "1/4 cup sugar", "3 tbsp whole milk", "1 egg, beaten", "2 tsp salt", "1/4 cup butter, melted", "4 1/2 cups bread floud, divided into 4 and 1/2", "8 cloves garlic, OPTIONAL - minced" ], "instructions" : [ "Lightly flour a rolling surface. Set aside about 1/2 cup flour for rolling.", "Dissolve yeast in warm water. Let stand 10 minutes, or until frothy.", "Stir in sugar, milk, eg,, salt, butter, and remaining flour to make a soft dough.", "Knead for 6-8 minutes.", "Place dough in a well-oiled bowl and cover with a damp cloth. Set aside to rise for about an hour. Dough should double in size.", "Punch down dough and knead in any seasonings such as minced garlic.", "Pull small handfuls off and roll into balls. Place on a tray and cover with a towel.", "Set to rise again, will double in size (30 minutes)", "Preheat grill (or frying pan) to medium-high heat. Roll one ball of dough out into a thin disc.", "Lightly oil the grill.", "Place dough on grill, cook for 2-3 minutes, flipping once. Will be puffy and light brown. Remove from grill, oil, roll, repeat. A pancake spatula is very helpful here!", "184 cals (15-yield) per slice" ], "name" : "Naan", "recipeYield" : "15 pieces", "tags" : [ "monte", "naan", "bread" ], "url" : "naan" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fea" }, "author" : "Cory Dodt", "ingredients" : [ "1 large egg", "1 tbsp warm water", "1 sheet puff pastries", "8 tbsp Hazelnut chocolate spread", "8 tbsp marshmallow cream, warmed soft; or 32 small marshmallows" ], "instructions" : [ "Preheat oven to 400 F.", "Beat egg with warm water to make egg wash.", "Separate puff pastry into 8 sections and lay them out on a cookie sheet.", "Spread each section with 1 tbsp hazelnut spread and 1 tbsp marshmallow cream and pinch shut.", "Brush pastries with egg wash on both sides.", "Bake 15 minutes." ], "name" : "Nutella Puff Pastries", "recipeYield" : "8", "tags" : [ "dessert", "pastry", "nutella", "eggs", "GOOD" ], "url" : "nutella-puff-pastries" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14feb" }, "author" : "Cory Dodt", "ingredients" : [ "1/4 cup all-purpose flour", "1 cup quick-cooking oats", "1 tbsp sugar", "1/2 tsp baking powder", "1/2 tsp baking soda", "1/4 tsp ground cinnamon", "1/8 tsp salt", "1 cup nonfat buttermilk", "2 tbsp butter, melted", "1 large egg", "Cooking spray" ], "instructions" : [ "Lightly spoon flour into a dry measuring cup; level with a knife. Combine the first 7 ingredients (through salt) in a medium bowl, stirring with a whisk.", "Combine buttermilk, butter, and egg in a small bowl. Add to flour mixture, stirring just until moist.", "Heat a nonstick griddle over medium heat. Coat pan with cooking spray. Spoon about 2 1/2 tbsp batter per pancake onto griddle. Turn pancakes over when tops are covered with bubbles; cook until bottoms are lightly browned." ], "name" : "Oatmeal Pancakes", "recipeYield" : "12 pancakes", "tags" : [ "pancakes", "oatmeal", "breakfast" ], "url" : "oatmeal-pancakes" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fec" }, "author" : "Cory Dodt", "ingredients" : [ "3 1/3 cups elbow macaroni", "4 tbsp butter", "4 tbsp flour", "1 tbsp salt", "1 1/2 tsp white pepper", "5 tsp mustard powder", "3 1/2 cups milk", "8 dashes Tabasco sauce", "5 cups sharp grated cheddar cheese", "2 tbsp butter, melted", "1/2 cup dry bread crumbs", "4 tsp paprika" ], "instructions" : [ "Cook macaroni as directed on package.", "Pour cooked macaroni into 3 qt baking dish.", "Melt butter in a large saucepan over low heat; blend in flour, salt, pepper, and mustard. Add milk and Tabasco, cook over moderate heat, stirring constantly, until sauce is thick and smooth. Remove sauce from heat; stir in cheese until melted.", "Combine sauce with cooked macaroni.", "Mix together melted butter, crumbs, and paprika.", "Sprinkle crumbs over macaroni.", "Bake at 350 F for 25-30 minutes." ], "name" : "Paprika Mustard Mac and Cheese", "recipeYield" : "12", "tags" : [ "mac and cheese", "macaroni", "cheese", "paprika", "mustard" ], "url" : "paprika-mustard-mac-and-cheese" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fed" }, "author" : "Cory Dodt", "ingredients" : [ "2 pounds heirloom tomatoes, cored, seeded, 1/2-inch pieces", "1/3 cup extra-virgin olive oil", "1/4 cup fresh lemon juice", "1 shallot, minced", "1 small clove garlic, minced", "Salt", "Pepper", "1 tsp sugar", "1 pound Fusili pasta, cooked, chilled", "12 ounces fresh mozzarella cheese, cut into 1/2-inch pieces", "1/2 cup chopped fresh basil", "1/2 tsp grated lemon zest" ], "instructions" : [ "Whisk the olive oil, lemon juice, shallow and garlic in a large bowl. Season with salt and pepper. Add sugar, if desired (depending on the sweetness of your tomatoes). Add the tomatoes and gently toss.", "Marinate at room temperature, about 15 minutes.", "Meanwhile, bring a large pot of water to a boil. Add the pasta and cook as the label directs. Drain in a colander.", "Add the pasta and mozzarella to the tomato mixture and gently toss to combine. Stir in the basil and lemon zest, and season with salt and pepper." ], "name" : "Pasta Caprese Salad", "recipeYield" : "6", "tags" : [ "salad", "caprese", "tomatoes", "mozzarella", "pasta", "GOOD" ], "url" : "pasta-caprese-salad" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fee" }, "author" : "Cory Dodt", "ingredients" : [ "10 oz rotini, gemelli, or penne pasta", "1 (16-oz) can chickpeas, drained and rinsed", "1/4 cup tahini", "4 tbsp lemon juice", "1 tsp ground cumin", "1-2 cloves garlic, crushed", "1 (12-oz) jar roasted red peppers with liquid, divided", "1/2 cup fresh parsley, chopped", "3 scallions, minced" ], "instructions" : [ "Cook the pasta in plenty of rapidly simmering water until al dente, then drain.", "Meanwhile, combine the next 5 ingredients (through garlic) in a food processor. Add half of the red peppers along with their liquid, and reserve the remaining red peppers.", "Process until the mixture is completely smooth. If too thick, add a small amount of water to loosen.", "Chop the reserved red peppers into fairly short, narrow strips. Combine them in a large serving bowl with the cooked pasta, sauce, parsley, and scallions. Toss well and serve.", "*Note: When reheating leftovers, add a small amount of water, as the sauce thickens as it stands." ], "name" : "Pasta with Red Pepper Hummus Sauce", "recipeYield" : "6", "tags" : [ "pasta", "hummus", "GOOD", "VEGAN" ], "url" : "pasta-with-red-pepper-hummus-sauce" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fef" }, "author" : "Cory Dodt", "ingredients" : [ "3 large (15-oz) cans sliced cling peaches packed in light juice", "1 stick butter, cut into thin slices (vegan: use margarine)", "1 box yellow cake mix" ], "instructions" : [ "Preheat oven to 350 F", "Drain peach juice into measuring cup, set aside", "Cover bottom of 9x13 baking dish with drained peaches.", "Pour cake mix evenly over peaches", "Drizzle peach juice evenly over cake mix", "Place slices all over mixture", "Bake until top is golden/bubbly, around 30-40 minutes." ], "name" : "Yellow Cake Peach Cobbler", "recipeYield" : "12", "tags" : [ "peach", "cobbler", "dessert", "VEGAN" ], "url" : "yellow-cake-peach-cobbler" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ff0" }, "author" : "Cory Dodt", "ingredients" : [ "1 pie crust layer", "3/4 cup all-purpose flour", "1/2 tsp salt", "1 tsp baking powder", "1 (3-oz) package vanilla pudding mix, non-instant", "3 tbsp butter, softened", "1 egg", "1/2 cup milk", "1 (29-oz) can sliced peaches in light juice, drained and syrup reserved", "1 (8-oz) package neufchatel, softened", "1/4 cup stevia baking blend", "1 tbsp white sugar", "1 tsp ground cinnamon" ], "instructions" : [ "Preheat oven to 350 F.", "Grease sides and bottom of a 10-inch deep-dish pie pan and place crust.", "In a medium mixing bowl, mix together flour, salt, baking powder and pudding mix. Mix in butter, egg, and milk. Beat for 2 minutes. Pour mixture into pie pan. Arrange the peach slices on top of the pudding mixture.", "In a small mixing bowl, beat cream cheese until fluffy. Add 1/2 cup sugar and 3 tbsp reserved peach juice. Beat for 2 minutes. Spoon mixture over peaches to within 1 inch of pan edge. Mix together 1 tbsp sugar and 1 tsp cinnamon, and sprinkle over top.", "Bake in the preheated oven for 30-35 minutes, until golden brown. Chill before serving.", "1 Serving = 228 g, 357 calories" ], "name" : "Peaches and Cream Pie", "recipeYield" : "8 slices", "tags" : [ "pie", "peaches", "dessert", "GOOD" ], "url" : "peaches-and-cream-pie" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ff1" }, "author" : "Cory Dodt", "ingredients" : [ "1 1/4 cups flour", "1/2 tsp salt", "1/4 tsp baking soda", "1/4 tsp baking powder", "2 tsp curry powder", "1 stick butter, softened", "1/2 cup brown sugar", "1/2 cup sugar", "1/2 cup peanut butter", "1 tsp vanilla", "1 egg", "1/2 cup sugar and 1/2 cup crushed peanuts for rolling" ], "instructions" : [ "Preheat the oven to 350 F", "Line a baking sheet with parchment.", "Whisk together the flour, salt, baking soda, baking powder and curry in a medium bowl.", "In a larger bowl, beat the butter and sugars until light and fluffy. Add in the peanut butter and beat until completely incorporated. Then beat in the eggs, vanilla, and slowly add in the flour until it is fully combined.", "Using a scoop, measure out a ball of dough and release it into your hand. Shape it into a round ball, then roll in sugar and garnish with a peanut.", "Bake cookies for about 10-12 minutes, or until the centers are just beginning to puff and deflate. A slightly under-baked cookie is better here. Cool on a rack." ], "name" : "Peanut Butter Curry Cookies", "tags" : [ "dessert", "cookie", "curry", "nuts", "sugar" ], "url" : "peanut-butter-curry-cookies" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ff2" }, "author" : "Cory Dodt", "ingredients" : [ "1/2 cup butter or margarine", "1/2 cup granulated sugar", "1/2 cup packed light brown sugar", "1/2 cup smooth peanut butter", "1 egg", "1/2 tsp vanilla extract", "1 cup all-purpose flour", "1/2 tsp baking soda", "1/4 tsp salt", "1 cup Peanut Butter M&M's (two 80-gram bags)" ], "instructions" : [ "Heat oven to 350F.", "Beat butter, granulated sugar, brown sugar, peanut butter, egg and vanilla in a large bowl until fluffy.", "Stir together the flour, baking soda, and salt; gradually add to butter mixture, beating until well-blended.", "Stir in candies.", "Drop, by heaping teaspoons, onto cookie sheet covered in parchment paper.", "Bake 10-12 minutes or until edges are lightly browned; remove from oven. Cool slightly; remove from pan to wire rack. Cool completely. Makes about 30 cookies." ], "name" : "Peanut Butter Peanut Butter M&M Cookies", "recipeYield" : "30 cookies", "tags" : [ "cookie", "dessert", "M&M's", "peanut butter", "GOOD" ], "url" : "peanut-butter-peanut-butter-m-m-cookies" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ff3" }, "author" : "Cory Dodt", "ingredients" : [ "1 tbsp olive oil", "1 tbsp Thai red curry paste", "1/2 tsp cinnamon", "1 medium red onion, peeled and diced", "4 cloves garlic, minced", "1 medium sweet potato, peeled and diced", "1 large yellow bell pepper, seeded and diced", "1 jalapeno, seeded and diced very finely (save a few seeds)", "1/2 lb dried black beans, soaked overnight and cooked until tender, or, 1 (15-oz) can black beans", "1 quart veggie broth", "1/2 cup all-natural peanut butter", "1/2 cup boiling water", "1/2 tsp red pepper flakes", "2 tbsp fresh cilantro, chopped", "1 lime, juiced", "3 tsp brown sugar", "Salt and black pepper, to taste" ], "instructions" : [ "Heat the olive oil in a large soup pot. Add the curry paste and cinnamon. Stir for a minute so that the olive oil gets infused with spice. Add the onion, garlic, sweet potato, bell pepper, and jalapeno. Stir and cook the veggies for 5-7 minutes, until the peppers and onion are softened.", "Add the beans and broth. Melt the peanut butter by mixing it with 1/2 cup boiling water. Add that to the mix. Add the red pepper flakes and cilantro.", "Bring the soup to a boil, then cover and simmer. Cook until sweet potatoes are tender, about 25 minutes.", "Stir in the lime juice and brown sugar. Season with salt and black pepper." ], "name" : "Peanut Butter Sweet Potato Soup", "recipeYield" : "8", "tags" : [ "GOOD", "VEGAN", "black bean", "sweet potato", "peanut butter", "soup" ], "url" : "peanut-butter-sweet-potato-soup" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ff4" }, "author" : "Cory Dodt", "ingredients" : [ "1 lb penne pasta", "1 1/2 cups small broccoli florets", "1 small carrot, thinly sliced", "1 small zucchini or yellow squash, cut into 1/4 inch dice", "3/4 cup raw cashews, soaked overnight, drained or 3/4 cup roasted cashews", "3 cloves garlic, crushed", "2 cups hot vegetable broth", "2 Hass avocados, halved and pitted", "3 scallions, chopped", "3 tbsp lemon juice", "1/2 tsp salt", "Pepper", "1 1/2 cup grape tomatoes, halved lengthwise", "1/3 cup fresh basil leaves, OR parsley, chopped", "Whole fresh basil leaves, for garnish" ], "instructions" : [ "Cook the penne in a large pot of boiling water, stirring occasionally, until it is tender, about 10 minutes.", "Meanwhile, start 2 cups water simmering in a medium saucepan. Suspend a steamer fan above the simmering water. About 5 minutes before the pasta is cooked, add the broccoli and carrots. About 2 minutes before the pasta is cooked, add the zucchini. Drain the cooked pasta and the vegetables at the same time and return both to the same pot.", "While the pasta is cooking, combine the drained cashews, garlic, and broth in a high-speed blender or food processor. Process until smooth and well-blended. Peel and pit the avocado and add it to the food processor along with the scallions, lemon juice, salt, and pepper to taste. Process until smooth and creamy. For a thinner sauce, add some almond milk, if needed. For a thicker sauce, add additional avocado. Taste and adjust the seasonings.", "Add the sauce to the pot containing the drained cooked pasta and vegetables. Add the tomatoes and chopped basil and toss gently to combine. Serve immediately, garnished with the whole basil leaves." ], "name" : "Penne Primavera with Avocado Cashew Cream", "recipeYield" : "8", "tags" : [ "penne", "pasta", "avocado", "nuts", "GOOD", "VEGAN" ], "url" : "penne-primavera-with-avocado-cashew-cream" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ff5" }, "author" : "Cory Dodt", "ingredients" : [ "3 tbsp sweet butter", "2 tbsp olive oil", "2 cloves garlic, minced", "2 cups heavy cream", "1/4 tsp white pepper", "1/2 cup grated parmesan cheese", "3/4 cup mozzarella cheese", "1/2 tsp dried basil", "1 bunch parsley, chopped fine" ], "instructions" : [ "Melt butter in a medium saucepan with olive oil over medium/low heat.", "Add the garlic, cream, white pepper and bring mixture to a simmer. Stir often.", "Add the parmesan cheese and simmer sauce for 8-10 minutes or until sauce has thickened and is smooth.", "When sauce has thickened add the mozzarella cheese and stir until smooth. STIR FREQUENTLY.", "When creamy and smooth, stir in basil and parsley." ], "name" : "Pepper Alfredo Sauce", "recipeYield" : "6", "tags" : [ "alfredo", "cheese", "parmesan", "italian", "GOOD" ], "url" : "pepper-alfredo-sauce" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ff6" }, "author" : "Cory Dodt", "ingredients" : [ "1 (8-oz) package refrigerated crescent rolls", "8 small slices mozzarella cheese", "8 tsp tomato paste", "1 tsp dried oregano/pizza spices" ], "instructions" : [ "Preheat oven to 350 F.", "Unroll dough and separate into 4 triangles.", "Pinch together to seal.", "Place 2 rectangles on a 9x13-inch baking sheet.", "Moisten edges of rectangles with water. Place 2 slices of mozzarella on each rectangle.", "Top each with 2 tsp tomato paste. Sprinkle each with 1/4 tsp spices.", "Cover each with remaining dough.", "Press edges firmly with fork.", "Bake 12-16 minutes or until golden brown.", "Optional: top with shredded mozzarella and parmesan.", "Pair with soup." ], "name" : "Quick Pizza Sandwiches", "recipeYield" : "4", "tags" : [ "monte", "pizza", "roll", "sandwich", "mozzarella" ], "url" : "quick-pizza-sandwiches" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ff7" }, "author" : "Cory Dodt", "ingredients" : [ "1 1/2 cups quinoa, rinsed in a sieve", "3 cups vegetable broth", "2 tbsp extra-virgin olive oil", "1 large onion, quartered and thinly sliced", "2 large broccoli crowns, cut into bite-sized pieces", "1/3 cup sun-dried tomatoes OR black olives, sliced", "Salt", "Pepper", "1 1/2 cups cheddar cheese" ], "instructions" : [ "Preheat the oven to 400 F.", "Bring 3 cups vegetable broth to a simmer in a medium saucepan. Stir in the quinoa, cover; and simmer gently until the water is absorbed, about 15 minutes.", "Meanwhile, heat the oil in a large skillet. Add the onion and saute until golden. Add the broccoli and enough water to keep the skillet moist. Cover and steam until the broccoli is tender-crisp, about 5 to 7 minutes.", "Transfer the mixture to a lightly-oiled, shallow 2-quart casserole. Sprinkle evenly with the remaining cheese. Bake until the top is golden and crisp, about 20-25 minutes.", "Let the casserole stand for 5 minutes, and serve." ], "name" : "Quinoa Broccoli Cheese Casserole", "recipeYield" : "6", "tags" : [ "quinoa", "broccoli", "cheese", "casserole", "GOOD" ], "url" : "quinoa-broccoli-cheese-casserole" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ff8" }, "author" : "Cory Dodt", "ingredients" : [ "4 cups elbow macaroni", "3 whole roasted red peppers, chopped (more to taste, can also use pimentos)", "1/2 cup black olives, chopped fine", "6 whole sweet/spicy pickle slices, diced (about 1/2 cup diced)", "3 whole green onions, sliced (white and dark green parts)", "1/2 cup light mayonnaise", "1 tbsp red wine vinegar or distilled vinegar", "2 tsp stevia sweetener, more or less to taste", "1/4 tsp salt, more to taste", "Plenty of black pepper", "1/4 cup milk, more if needed", "Splash of pickle juice", "Extra pickle juice to taste" ], "instructions" : [ "Cook the macaroni according to the package directions. Drain and set aside.", "Mix together mayo, vinegar, stevia, salt, and pepper. Splash in enough milk to make it pourable. Splash in pickle juice for extra flavor. Taste and adjust seasonings as needed. Set aside.", "Place cooled macaroni in a large bowl and pour in 3/4 of the dressing. Toss and add more dressing if you'd like. (Dressing will seem a little thin, but it will thicken up as the salad chills.)", "Stir in the olives, roasted red peppers (or pimentos), pickles, and green onions. Add more of any ingredient if you'd like more stuff going on! At the end, splash in a little more pickle juice and stir. ", "Chill for at least 2 hours before serving. Sprinkle with sliced green onion to serve!" ], "name" : "Red Pepper Macaroni Salad", "recipeYield" : "12", "tags" : [ "macaroni", "salad", "pasta", "side", "GOOD" ], "url" : "red-pepper-macaroni-salad" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ff9" }, "author" : "Cory Dodt", "ingredients" : [ "2 tbsp olive oil", "1 large onion, chopped fine", "3-4 cloves garlic, minced", "1 2-inch knob ginger, diced fine, or 2 tsp ginger paste", "1 serrano chile, split to extract 1/4 of the seeds and discarding the rest, chopped fine", "5 tsp curry powder, divided", "Salt", "Pepper", "Cayenne pepper", "1 (14-oz) block paneer, queso blanco, or tofu, drained", "2 (10-oz) packages frozen spinach, thawed (in warm water if necessary), drained", "1 1/2 cups heavy cream", "1 cup long grain white rice, uncooked" ], "instructions" : [ "Vegan: Maybe try coconut milk? (And tofu, obviously.)", "Heat the olive oil in a large skillet over medium heat. Add onion, garlic, serrano chile, ginger, 3 tsp of curry powder, salt, pepper, and cayenne to taste. Coat evenly and heat 10-15 minutes.", "In a medium skillet, saute cheese/tofu until squishy with a nice golden outside. (4 minutes?) Set aside.", "Add the thoroughly-drained spinach to the pan and stir until incorporated. Add 2 tsp curry powder and more salt and pepper, stir. Add a cup of heavy cream, stir until pan is golden yellow and slightly soup. Add cream until sufficiently soupy. Cook 5 minutes. Add cheese/tofu, stir. Adjust spices and cream to taste.", "Turn heat to low, simmer 30 minutes.", "Meanwhile, cook rice in a saucepan with 2 cups water until fluffy, about 20 minutes.", "Serve sauce over rice." ], "name" : "Saag Paneer", "recipeYield" : "6", "tags" : [ "saag paneer", "indian", "spinach", "cheese", "tofu", "GOOD" ], "url" : "saag-paneer" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ffa" }, "author" : "Cory Dodt", "ingredients" : [ "1 (16-oz) tub soft tofu", "1 tbsp butter", "1 cup salsa", "1/2 tsp curry powder", "6 (8- or 10-inch) soft flour tortillas", "1 1/2 cups cheddar or nacho cheese" ], "instructions" : [ "Drain the tofu and cut into 1/2-inch slices. Blot well between paper towels.", "Heat butter in a medium skillet. Add the tofu and mash with a potato masher or a large fork.", "Stir in the salsa and curry powder, then cook over medium heat for 3-4 minutes, until well-heated through. Turn the heat up and cook a little longer if there is excess liquid in the skillet that needs to evaporate.", "Divide the scrambled tofu mixture among the tortillas, placing it in the center of each in a kind of oblong mound, leaving room at each end. Sprinkle some cheese over the tofu (about 3-4 tbsp for each tortilla).", "Microwave each for 30-40 seconds, or arrange all of them open-faced on a baking sheet, and bake in a preheated 350-degree F oven until the cheese is melted. Fold two ends over the tofu mixture, then roll up the rest. Repeat with each burrito, then serve at once." ], "name" : "Scrambled Tofu Burritos", "recipeYield" : "6", "tags" : [ "burrito", "tofu", "eggs", "GOOD" ], "url" : "scrambled-tofu-burritos" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ffb" }, "author" : "Cory Dodt", "ingredients" : [ "1 spaghetti squash", "1 head garlic", "1/4 cup olive oil", "2 cups bread crumbs", "1 cup milk", "1/4 cup pine nuts, roasted", "2 eggs, beaten", "1 tbsp fresh basil, chopped", "1 tbsp fresh thyme, chopped", "1 tbsp flat parsley, chopped", "6 Yukon Gold potatoes, boiled but not peeled", "1/4 cup butter, melted", "1/2 cup smooth goat cheese", "1 cup heavy whipping cream", "3 cups sliced mushrooms", "6 cups wild mushooms (you can substitute zucchini)", "1 medium onion, chopped", "2 carrots, chopped", "2 stalks celery, chopped", "4 cloves garlic, minced", "1 cup dried Du Puys lentils, cooked (could use kidney beans or chickpeas)", "Shallots, fried, to garnish", "Salt and pepper" ], "instructions" : [ "Cut the spaghetti squash in half and remove the seeds. Place on a baking sheet and bake for 1 1/2 hours. As an alternative, place on a plate and cook in the microwave on high for about 20 minutes.", "Meanwhile, start boiling water (2 cups to 1) for lentils. Cook the lentils 15-20 minutes.", "Meanwhile, start boiling water to cook the potatoes, which need 25-30 minutes at full boil. Put potatoes into the water while it's still cold.", "Heat the oven to 350 F.", "Put the garlic head on a baking tray. Drizzle with 1 tsp (5 ml) olive oil. Season with salt and pepper and put in the oven for 30 minutes or until the garlic is very tender.", "In a bowl, mix the bread crumbs with the milk. Let stand for 5 minutes until all the liquid has been absorbed. Mix in the pine nuts, the eggs, and the herbs. Put aside.", "Mash the potatoes with the butter, goat cheese, cooked garlic puree and cream to make them nice and smooth. Season with salt and pepper.", "Remove the spaghetti squash flesh with a fork and put it in a bowl. Season with salt and pepper and put aside.", "Preheat the oven to 450 F.", "Heat the remaining oil in a large pan and saute the onions, carrots, and celery over medium heat until soft and translucent, about 5 minutes. Add garlic and mushrooms (or zucchini) and continue cooking until brown, about 10 minutes. Remove from heat. Add the cooked lentils and the bread mixture. Stir and put aside.", "In an 8x11 inch baking dish, spoon the vegetable mixture onto the bottom. Layer with the spaghetti squash, then the potatoes and smooth them down. Cook in the oven for 30 minutes or so until top is slightly browned.", "Garnish with fried shallots to taste." ], "name" : "Shepherds' Pie with Garlic Potatoes", "recipeYield" : "12", "tags" : [ "GOOD", "potato", "shepherd", "pie", "mushrooms" ], "url" : "shepherds--pie-with-garlic-potatoes" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ffc" }, "author" : "Cory Dodt", "ingredients" : [ "1 link soyrizo", "1 orange, red, or yellow bell pepper, cut bite-sized", "1 ear sweet corn or yellow corn, cut off the cob", "1/3 cup serrano peppers (about 4 peppers), cut into slices", "2 large eggs", "1/2 stalk romaine lettuce", "1/2 avocado, peeled, cut into thin slices", "1 tbsp lemon juice", "1 tbsp lime juice", "3 tbsp light sour cream", "1 tbsp olive oil", "1 pinch lime salt", "Pepper" ], "instructions" : [ "Roast corn in a dry medium-high skillet, stirring only once or twice, about 5 minutes.", "Heat oil in a medium skillet. Cook soyrizo 2 minutes, flip, and cook 1 more minute. It should be brown after the first flip.", "Add all the peppers, the corn, and the eggs. Fry on medium heat for 7-8 minutes, stirring occasionally.", "In a mixing bowl, combine pepper/soyrizo mixture with sour cream and half of the sliced avocado, and mix.", "Settle on a bed of romaine lettuce, garnish with remaining sliced avocado. Add lemon and lime juice, add lime salt, add pepper to taste." ], "name" : "Soyrizo Avocado Pepper Salad", "recipeYield" : "3", "tags" : [ "avocado", "soyrizo", "peppers", "spicy", "GOOD" ], "url" : "soyrizo-avocado-pepper-salad" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ffd" }, "author" : "Cory Dodt", "ingredients" : [ "4 tbsp extra-virgin olive oil, divided into 3 and 1", "8-10 cloves garlic, minced", "3 tbsp toasted pine nuts, OR 1/4 cup crushed walnuts OR toasted slivered almonds", "1 pound spaghetti, broken in half", "2-4 oz oil-cured sun-dried tomatoes, drained, finely chopped", "2/3 cup fresh parsley, finely chopped", "Salt", "Ground pepper", "Parmesan cheese, grated (vegan: optional)" ], "instructions" : [ "Toast the nuts in a small, dry skillet, tossing frequently, until golden.", "Heat 1 tbsp of the olive oil in a small skillet. Add the garlic and saute over medium-low heat, stirring frequently, until golden. Remove from heat.", "Cook the spaghetti in plenty of rapidly-simmering water until al dente.", "Drain and transfer to a serving bowl. Add the garlic, tomatoes, parsley, nuts, and remaining olive oil. Toss together.", "Season to taste with salt and pepper and serve at once.", "Pass around the parmesan cheese." ], "name" : "Spaghetti Aglio Olio with Sun-Dried Tomatoes and Nuts", "recipeYield" : "8", "tags" : [ "spaghetti", "pasta", "nuts", "sun-dried tomatoes", "GOOD", "VEGAN" ], "url" : "spaghetti-aglio-olio-with-sun-dried-tomatoes-and-nuts" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14ffe" }, "author" : "Cory Dodt", "ingredients" : [ "1 (14-oz) package water-packed extra-firm tofu, drained, dried, cut into 1/2-inch cubes", "1 (1-pound) package pad thai noodles or Chinese lo mein egg noodles (vegan: whole wheat thin spaghetti?)", "2 tbsp dark sesame oil", "4 cloves garlic, minced", "1/4 tsp salt", "4 heads baby bok choy, trimmed and cut crosswish into 2-inch-thick strips", "1 tbsp sugar", "3 tbsp chile paste with garlic, such as sambal oelek (vegan: check ingredients of this item)", "2 tbsp fresh lime juice", "2 tbsp sweet bean sauce", "2 tbsp low-sodium soy sauce" ], "instructions" : [ "Cook noodles in a large pan of boiling water 3 minutes or until done.", "Drain in a colander over a bowl, and research 1 cup cooking liquid.", "Wipe pan with paper towels and heat oil in pan over medium heat.", "Add garlic to pan; cook 30 seconds, stirring constantly.", "Add salt and bok choy; cook 30 seconds, stirring frequently.", "Stir in 1/2 cup of reserved cooking liquid, bring to a boil. Reduce heat, and cook 4 minutes.", "Add noodles, remaining cooking liquid, and sugar mixture to pan; toss to combine.", "Cook 2-3 minutes, allowing time for sauce to boil and thicken slightly, tossing to coat.", "Add tofu, toss to combine.", "Serve immediately." ], "name" : "Spicy Malaysian-Style Noodles", "recipeYield" : "6", "tags" : [ "spicy", "pasta", "noodles", "asian", "malaysian", "tofu", "VEGAN", "GOOD" ], "url" : "spicy-malaysian-style-noodles" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a14fff" }, "author" : "Cory Dodt", "ingredients" : [ "1 1/2 lb cremini mushrooms, roughly chopped", "1/2 pound shiitake mushrooms, roughly chopped", "Salt", "1-1 1/2 cups chopped onions", "1/4 cup olive oil, plus more, for keeping the noodles from sticking to each other", "4 cloves garlic, chopped", "1 (6-oz) can tomato paste", "2 cups tomato sauce", "1 (28-oz) can crushed tomatoes", "1 cup water", "1 tbsp dried thyme", "1 tsp red pepper flakes", "1 tbsp sugar", "2 tsp dried basil", "2 (10-oz) boxes frozen chopped spinach, thawed, squeezed dry", "3/4 lb oven-ready lasagna noodles (12-15 noodles)", "1 (16-oz) container ricotta cheese", "1/4 cup fresh basil, chopped", "1/4 lb pecorino cheese or parmesan cheese, grated (about 1 cup)", "1 pound shredded mozzarella cheese, about 4 cups" ], "instructions" : [ "Before you begin, make sure to THAW and DRAIN the spinach thoroughly. This can take some time so plan ahead. I like to leave it in the boxes, place the boxes in warm water for a while, then pour it all into a colander and place something heavy on top.", "PLACE MUSHROOMS in a large (6-8 quart) saute pan on high or medium-high heat, STIRRING or shaking frequently. You may hear them squeak. ADD SALT evenly. The mushrooms will sizzle and then start to release water. (Note that you are not adding fat at this point to the pan; this method of cooking mushrooms in their own moisture is called \"dry sauteing\".) Once the mushrooms start to release water into the pan, STIR IN the chopped onions. Cook until the mushrooms are no longer releasing moisture and the mushroom water has boiled away, about 5-10 minutes more.", "ADD the olive oil to the mushrooms and stir to coat. SAUTE the mushrooms and onions for about a minute. ADD the garlic and cook for another minute. STIR IN the tomato paste, cook for a minute longer. RESEARCH 1 cup of the tomato sauce (it will go in the bottom of the casserole dish), and POUR the remaining cup of tomato sauce into the mushrooms along with the crushed tomatoes, and one cup of water. STIR IN the thyme, sugar, dried basil, and red pepper flakes. Bring to a simmer, then lower the heat and continue to SIMMER for 20 minutes.", "PREHEAT the oven to 350 F.", "SPREAD the one cup of reserved tomato sauce over the bottom of a large (preferably 10x15-inch) casserole dish. (If your casserole dish is smaller, you may need to add another layer as you go through this step.) PLACE a layer of lasagna noodles down over the tomato sauce, slightly overlapping. (For our 10x15-inch dish, we ultimately fit 3 layers of noodles, each layer with 6 noodles.) SPRINKLE half of the ricotta cheese over the noodles. SPRINKLE half of the drained spinach over the ricotta. SPRINKLE half of the mozzarella cheese over the spinach, and just a quarter of the pecorino cheese. Then SPOON 1/3 of your mushroom sauce over the mozzarella. SPRINKLE half of the fresh basil over the sauce if using.", "REPEAT the layering process. Place a second LAYER of noodles over the sauce. SPREAD the remaining ricotta, spinach, and mozzarella over the noodles. SPRINKLE another quarter of the pecorino along with the mozzarella. TOP with another third of the mushroom sauce and the remaining fresh basil. LAYER your final layer of lasagna noodles over the sauce. SPREAD the remaining mushroom sauce over the lasagna noodles, and SPRINKLE with the remaining pecorino cheese. TIP: Be sure to cover the noodles completely with sauce, don't leave them exposed or the oven will dry them out around the edges.", "SPREAD a little olive oil over the inside of a piece of aluminum foil, then COVER the casserole dish and crimp the edges. BAKE at 350 F for 25 minutes, then remove the foil and bake uncovered for an additional 25 minutes.", "Let the lasagna cool for 10 minutes before cutting to serve." ], "name" : "Spinach and Mushroom Lasagna", "recipeYield" : "12", "tags" : [ "spinach", "mushroom", "lasagna", "cheese", "GOOD" ], "url" : "spinach-and-mushroom-lasagna" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a15000" }, "author" : "Cory Dodt", "ingredients" : [ "2 (10-oz) packages frozen chopped spinach, thawed and drained", "8 cups vegetable broth", "1 cup carrot, shredded", "1 cup onion, chopped", "16 garlic cloves, minced", "1/3 cup butter", "1/2 cup all-purpose flour", "1 cup half-and-half", "1 tsp black pepper" ], "instructions" : [ "In a 5-quart dutch oven, bring spinach, broth and carrots to a boil. Reduce heat; simmer 5 minutes, stirring occasionally. Remove from heat; cool to lukewarm.", "In a skillet, saute onion and garlic in butter until onion is soft, about 5-10 minutes.", "Add flour; cook and stir over low heat for 3-5 minutes. Add to spinach mixture.", "Set aside 1/4 of the spinach mixture (for texture).", "Puree remaining mixture in batches in a blender or food processor.", "Pour the puree into a large saucepan. Add reserved spinach, half-and-half, and pepper, and heath through but do not boil." ], "name" : "Spinach Garlic Soup", "recipeYield" : "12", "tags" : [ "monte", "spinach", "garlic", "soup", "GOOD" ], "url" : "spinach-garlic-soup" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a15001" }, "author" : "Cory Dodt", "ingredients" : [ "3 1/2 tbsp stevia sweetener, or 12 packets", "1/2 cup warm water" ], "instructions" : [ "Shake together until completely dissolved.", "Store refrigerated, use quickly." ], "name" : "Stevia Simple Syrup", "tags" : [ "stevia", "syrup", "beverage", "two ingredients", "VEGAN" ], "url" : "stevia-simple-syrup" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a15002" }, "author" : "Cory Dodt", "ingredients" : [ "2 pie crust layers", "3 cups rhubarb, cut into 1-1/2-inch pieces", "2 cups fresh strawberries, sliced", "1 1/2 cups white sugar", "4 tbsp tapioca mix", "1 pinch salt", "1 tsp ground nutmeg" ], "instructions" : [ "Preheat oven to 425 F.", "Line a pie dish with one layer of pie crust.", "Mix the rhubarb, strawberries, sugar, tapioca, salt and nutmeg until the fruit is well-coated. Pour filling into the lined pie dish and dot with butter. Cover with the top crust, seal the edges and cut three 1-inch slits in the top of the crust.", "Bake pie at 425 F for 20 minutes. Reduce temperature to 375 F and bake for an additional 20 minutes.", "Let pie cool before cutting." ], "name" : "Strawberry Rhubarb Pie", "recipeYield" : "8 slices", "tags" : [ "pie", "dessert", "rhubarb", "strawberry", "GOOD" ], "url" : "strawberry-rhubarb-pie" }
{ "_id" : { "$oid" : "539c23dc0b66310b45a15003" }, "author" : "Cory Dodt", "ingredients" : [ "3 cups all-purpose flour", "1 1/4 tsp salt", "2/3 cup vegetable oil", "1/2 cup milk", "1/4 tsp cardamom" ], "instructions" : [ "In a large bowl, combine the flour, cardamom, and salt. Place the 1/2 cup of oil in a 1-cup-sized measuring cup and top with the 6 tbsp of milk. DO NOT MIX! Pour oil and milk over flour and blend with a fork until it forms a ball of dough.", "Divide dough into 2 balls. Place 1 ball on a sheet of waxed paper, and cover it with another sheet of waxed paper. Roll it flat with a rolling pin to fit your pie plate. Repeat with the remaining dough ball.", "Peel the paper off the top layer of crust, pick up the wax paper underneath it, and flip the crust into your pie plate.", "When you have filled your pie with filling, repeat with your second layer." ], "name" : "Cardamom Pie Crust", "recipeYield" : "2 layers", "tags" : [ "pie", "crust", "cardamom", "GOOD" ], "url" : "cardamom-pie-crust" }
{ "_id" : { "$oid" : "539c97ba0b6631719aa7007f" }, "author" : "Cory Dodt", "ingredients" : [ "Pizza stone and peel", "3 cloves garlic, minced", "1 cup onion, (about half an onion) chopped small", "1/2 cup marinated artichoke hearts, drained, chopped small", "1/2 cup marinated red pepper, drained, chopped small (optional)", "1/4 cup black olives, sliced (optional)", "1/4 cup green onions, sliced (optional)", "1/4 cup spinach, chopped small (optional)", "Flour", "1 package Trader Joe's herb pizza dough", "1 cup pizza sauce", "3 cups shredded mozzarella or cheddar cheese, or a combination", "2 oz light feta cheese crumbles" ], "instructions" : [ "Preheat oven to the maximum temperature, 550 usually. Place your cold pizza stone in the oven as it starts to heat.", "Sautee onions with minced garlic over medium-high heat for several minutes, until just starting to turn translucent.", "Flour your pizza peel well, place the dough in the middle and cover it with wax paper. Roll out the dough into a pizza shape. Pinch the edges into a crust.", "Spread pizza sauce heavily over the pizza. Every bit of pizza dough should be covered, although you may be able to see the color of the dough in spots.", "Spread the shredded cheese evenly over the sauce. The sauce should be completely covered, but you may be able to see the red color in spots and around the edges.", "Spread the sauteed onions, artichokes and any other vegetables over the pizza.", "Sprinkle feta cheese crumbles evenly over the pizza.", "Carefully slide the pizza onto the hot pizza stone in the oven.", "Bake for 11-15 minutes, until edges are medium brown and feta cheese has melted." ], "name" : "Artichoke Pizza 1", "recipeYield" : "8", "tags" : [ "pizza", "artichoke", "onion" ], "url" : "artichoke-pizza-1" }
{ "_id" : { "$oid" : "55188d09331a856489c2e5c6" }, "name" : "Quinoa, Fava Bean, and Chard Veggie Burgers", "url" : "quinoa--fava-bean--and-chard-veggie-burgers", "importedFrom" : "http://food52.com/recipes/21779-quinoa-fava-bean-and-chard-veggie-burgers", "author" : "/users/10741-carolyn-cope", "image" : "https://d2k9njawademcf.cloudfront.net/indeximages/32285/full/Quinoa_Chard_Fava_Bean_Veggie_Burgers.jpg?1403275772", "recipeYield" : "Serves6", "tags" : [], "ingredients" : [ "1 cup cooked quinoa", "2 cups fresh or frozen fava beans (see note)", "4 ounces chard, center ribs removed", "1 onion, diced", "2 garlic cloves, minced", "1 tablespoon chopped fresh dill (or 1 teaspoon dried)", "2 large eggs, lightly beaten", "1/2 cup dry breadcrumbs", "1/2 teaspoon fine sea salt", "1/4 teaspoon freshly ground black pepper", "3 tablespoons olive oil, divided", "6 ounces Halloumi cheese, cut into 6 slices", "6 tablespoons olive tapenade (purchased is fine)", "6 whole grain rolls", "6 handfuls mixed greens, such as frisee and pea shoots" ], "instructions" : [ "Place the quinoa in a large bowl and set aside for a few minutes.", "Fill a medium pot halfway with water and bring to a boil. Cook the fava beans for two to four minutes, until just tender, and drain thoroughly. If your beans are larger and have tough skins, remove the skins. If they're young and tender, feel free to leave them on. In the bowl of a food processor, pulse the beans until they form a chunky puree. It shouldn't be totally smooth, but it should hold together fairly well. Scrape the bean puree into the bowl with the quinoa.", "Drain and dry the pot you used for the fava beans. Over medium heat, warm one tablespoon of the olive oil. Cook the onion without browning until soft, about five minutes.", "Meanwhile, julienne the chard leaves: stack the leaves on top of one another and roll the stack from tip end to stem end into a cigar shape. Then use a large knife to cut thin crosswise slices of the cigar. When you're done you should have nice long, thin ribbons of chard. Add the chard ribbons to the onions along with the garlic and cook, stirring frequently, until the chard is wilted. Add the contents of the pot to the bowl.", "Add the dill, eggs, breadcrumbs, salt, and pepper to the bowl, and mix everything together thoroughly. Cover the bowl and chill the mixture for 30 minutes.", "When you're ready to make the burgers, heat two tablespoons of the olive oil over medium heat in a cast iron or other heavy pan. Scoop up the mixture by palm-sized amounts and form patties with your hands. (You may have more than enough for six burgers.) Cook burgers, in batches if necessary to avoid crowding, until nice and brown on the underside, about four minutes. Gently flip and cook until the other side browns and the burgers are cooked through, about four minutes more. If cooking in batches, you may need to add more oil. Place each burger into a roll.", "Cook the Halloumi slices in the pan until browned on both sides and place a slice atop each burger. Top with some olive tapenade and a handful of greens and serve immediately. Extra cooked burgers or uncooked mixture will keep in the fridge for two days." ] }
{ "_id" : { "$oid" : "5518d8bd331a856947ed0252" }, "author" : "/users/9023-kaykay", "image" : "https://d2k9njawademcf.cloudfront.net/indeximages/42993/full/2013-1107_absurdly-addictive-asparagus-021.jpg?1403292535", "importedFrom" : "http://food52.com/recipes/4023-absurdly-addictive-asparagus", "ingredients" : [ "4 ounces pancetta, cut into 3/8 inch to 1/4 inch dice", "1 tablespoon butter", "1 pound asparagus, woody ends trimmed and sliced into 2 inch pieces on the bias", "1 1/4 cups leek, thinly sliced crosswise (white and pale green parts only)", "2 cloves garlic, minced", "Zest of one lemon", "1 teaspoon orange zest", "2 tablespoons toasted pine nuts", "1-2 tablespoons Italian parsley, chopped", "Salt and freshly ground pepper to taste" ], "instructions" : [ "In a large non-stick pan, saut pancetta, stirring frequently, over medium heat, until crisp and lightly golden.", "Add 1 tablespoon of butter to pan. Add asparagus pieces and leek and saut until asparagus is tender crisp, about 3-4 minutes.", "Add garlic, lemon and orange zest, toasted pine nuts and parsley and saut for about 1 minute, until fragrant. Season to taste with freshly ground pepper and salt and serve immediately." ], "name" : "Absurdly Addictive Asparagus", "recipeYield" : "Serves4", "tags" : [], "url" : "absurdly-addictive-asparagus" }
{ "_id" : { "$oid" : "5518defb331a856947ed0253" }, "author" : "/users/124167-sarah-jampel", "image" : "https://d2k9njawademcf.cloudfront.net/indeximages/53081/full/2015-0317_smitten-kitchens-caramel-cake-033.jpg?1427315937", "importedFrom" : "http://food52.com/recipes/34816-the-smitten-kitchen-s-caramel-cake", "ingredients" : [ "2 cups plus 2 tablespoons sifted cake flour", "1 teaspoon baking powder", "3/4 teaspoon baking soda", "1/2 teaspoon salt", "1 stick (8 tablespoons) unsalted butter, softened", "1 cup sugar", "1 teaspoon vanilla extract", "2 large eggs, brought to room temperature for 30 minutes", "1 cup well-shaken buttermilk", "1 cup heavy cream", "1/2 cup packed dark brown sugar", "1 tablespoon dark corn syrup", "1 teaspoon vanilla extract", "Equipment: a candy thermometer" ], "instructions" : [ "Preheat the oven to 350 F and place a rack in the middle. Butter an 8-inch square cake pan and line it with a square of parchment paper. Butter the parchment paper. (I know you do not want to do this, but do take these precautions: These extra steps are worth it in the end.)", "Sift together the flour, baking powder, baking soda, and salt. (You can also get away with whisking these dry ingredients together in a bowl, make sure to thoroughly aerate and incorporate them.)", "Beat butter and sugar in a large bowl with an electric mixer at medium speed until pale and fluffy, 3 to 5 minutes. Beat in vanilla, then add the eggs, one at a time, beating well after each addition. Turn the mixer to low speed and beat in the buttermilk until just combined (don't worry if your mixture looks curdled). Add flour mixture in 3 additions, mixing until each is just incorporated.", "Spread the batter evenly into your prepared pan, then knock it on the counter several times to get rid of any air bubbles.", "Bake for 35 to 40 minutes, until golden. A toothpick or thin knife inserted into the center of the cake should come out clean, but be careful not to overbake the cake. It should feel moist on top and be springy to touch.", "Cool the pan on a rack for 10 minutes, then run a knife around the edges, invert the pan onto the rack, and cool completely, at least 1 hour. If you want to eat the cake tomorrow, you can store it in an airtight container (or wrapped in a layer of plastic wrap followed by a layer of aluminum foil) at room temperature until the next day.", "Once the cake is cool, make the caramel glaze: Attach a candy thermometer to a 1 1/2-quart heavy saucepan and pour in the cream, brown sugar, corn syrup, and a pinch of salt to a boil, stirring until the sugar is dissolved. Boil, without stirring, until the glaze reaches 210 to 212 F on thermometer, about 12 to 14 minutes, then stir in vanilla. If you want a thicker caramel topping -- more like a coating of candy rather than a thin glaze -- boil the caramel so that it's hotter. But be careful so that it doesn't burn! And know that the caramel topping will be much harder the next day.", "Put the rack with the cake in or over a shallow baking pan and pour the hot glaze over top, allowing it to run down the sides. Do not worry if it puddles in the bottom of the pan -- you can eat this leftover caramel with a spoon later on. Cool until the glaze is set, about 30 minutes." ], "name" : "The Smitten Kitchen's Caramel Cake", "recipeYield" : "Makesone 8-inch square cake", "tags" : [], "url" : "the-smitten-kitchen-s-caramel-cake" }
{ "_id" : { "$oid" : "5519d986331a855e4d178602" }, "author" : "chrisandrewwils ...", "image" : "https://picmix-c-mufumbo.netdna-ssl.com/5054763517345792=s1280=h600", "importedFrom" : "https://allthecooks.com/@chrisandrewwilson/really-good-low-carb-lasagna-4VLZP5gP8T", "ingredients" : [ "eggs", "heavy cream", "taco seasoning", "cream cheese", "shredded cheese (cheddar/mozz)", "Ground beef", "Low carb/low sugar pasta sauce", "parmesan cheese", "mozzarella cheese", "Italian seasoning" ], "instructions" : [ "Directions1Preheat oven for 350", "2Greese 13x9 baking pan", "3Sprinkle a mixed one cup of cheddar and mozzarella cheeses over the bottom of the dish.", "4Soften cream cheese in the microwave and mix all bottom layer ingredients in a bowl until smooth.", "5Pour over cheese in the baking dish and bake for 25 minutes.", "6Brown ground beef and drain", "7Turn off heat and add pasta sauce to the ground beef.", "8When bottom layer is done pour meat sauce into the pan and spread it evenly", "9Sprinkle parmesan cheese evenly over the meat sauce. Then cover with 1 cup of mozzarella then sprinkle Italian seasoning. Bake for another 15 minutes." ], "name" : "Really good Low carb Lasagna!", "tags" : [], "url" : "really-good-low-carb-lasagna-" }
{ "_id" : { "$oid" : "55207646331a850744e75f33" }, "author" : "Debi Mazar and Gabriele Corcos", "image" : "http://cook.sndimg.com/content/dam/images/cook/fullset/2012/9/5/1/CCUTG109_Limoncello-Recipe_s4x3.jpg/jcr:content/renditions/cq5dam.web.266.200.jpeg", "importedFrom" : "http://www.cookingchanneltv.com/recipes/debi-mazar-and-gabriele-corcos/limoncello.html", "ingredients" : [ "Limoncello", "6 1/3 cups /1.5 liters 75-percent volume  alcohol (recommended: 2 bottles Everclear Grain Alcohol)", "14 lemons", "6 1/3 cups /1.5 liters water", "2 1/3 pounds/1050 grams sugar" ], "instructions" : [ "After a few weeks of brewing, sitting in plain view on my library, the long awaited Limoncello is finally ready!", "So many of you have been asking about my family recipe for this delicious liquor, well, now you have it: this episode in fact features a recipe from my family's vault, straight out of Aunt Laura's handwritten kitchen book, this Limoncello will enter your home and never leave. Get ready, your friends will ask for it, your family will drink it every time they come over, and in summer it will literally fly out of the freezer.", "The history of Limoncello is kind of confused, as there are indications of a liquor brewed using lemons throughout the center of Italy for many centuries... however, it was only in 1988 that an official trademark was deposited by the Canale family in Capri. Besides their business operation though, some Italians believe that Limoncello dates as back as the beginning of the cultivation of lemons in central and southern Italy, especially when referred to the oval lemon of Sorrento, which traditionally is the best kind of citrus you can use to make it.... and obviously, as often happens when talking alcohol, priests are held accountable by many, for inventing this incredible \"Liquid Gold\"!", "Debi and I love to drink a shot of Limoncello during hot summer nights, after dinner... It has a special freshness and a great liquor punch that combined together really make this drink a must for anybody's freezer.", "Summer is already over, you got now a few months for practicing and researching your own flavor and balance of ingredients.", "In fact, even if this recipe is extremely simple, the sweetness of the drink can be adjusted to your likings; after tasting your first batch of Limoncello (in about a month and a half from now) you will be able to assess if you would like it to be more or less sugary. We personally like our drinks to be more on the dry side, and the proportion of ingredients we are giving you reflects that.", "Grazie Zia Laura, for opening your secret kitchen book for us... we might think of starting designing a label for it now and put it in our market!", "Enjoy and brew responsibly!", "To make the Limoncello:", "This recipe occurs in 2 different stages: first the macerating of the lemon peels in alcohol, and then the actual brewing with the rest of the ingredients.", "First stage:", "Peel the lemons, making sure to only separate the yellow part of the peel from the fruit, and not go too deep.", "A potato peeler does the trick, even if it behaves sketchy in the hand (lemons are much rougher than potatoes) still, you can try with a small blade, like a paring knife, but you will probably end up cutting too deep.", "Place the peels in glass jars, possibly big enough to accommodate all the ingredients in the recipe, seal tight and let rest for two weeks. Find a dark corner in your house, even a basement or a cellar where to let your Limoncello rest, absolutely do not leave it exposed to sunlight... also, try to resist the temptation of opening your jars and sniffing it. It is called \"resting\" for a reason, be respectful, you will be rewarded later! We actually keep our jars on a library, to decorate our dining room...", "Second stage:", "After macerating for two weeks, the alcohol is now ready to be drained and mixed with the water and sugar.", "Heat the water in the pan and mix the sugar, then let cool off for about 1 hour, stirring every now and then to make sure that the sugar collected on the bottom of the pan \"stays in the game\".", "Drain the lemon peels from the jars and mix in the sugar water. Be careful, this is a moment you have to keep an eye on your volumes: figure out how many jars you are working with and maintain the proportion of ingredients! To simplify your life you, can brew everything in a big enough pot to accommodate all ingredients and then bottle it back into the jars.", "And again, for the second time, you have to exercise control and patience. Sniff all you want, than close your jars tight and let rest for a whole month. You can shake the liquid gently when you start noticing some sugar deposited on the bottom of the jars. Where did you decide to let your Limoncello rest, in the basement on a kitchen shelf? Remember, no sunlight!", "After a month, it is time to bottle, and it is totally up to you, just make sure you can fit your bottles in the freezer.", "Our first batch will be ready this coming weekend and we decided to keep only one bottle for us, most of the Limoncello will be small bottled and given to friends... Our recipe will evolve, and in a few days we will have already an excuse to start brewing more.", "This recipe is fun and simple, good to drink and good to watch while in the making; we have been so proud of ourselves this past summer, looking at our liquid gold decorating our house. Now we also have figure out a great, well thought out, made with love, and on a seriously controlled budget, Christmas present.", "Brew Responsibly!" ], "name" : "Limoncello", "recipeYield" : "Varies", "tags" : [], "url" : "limoncello" }
{ "_id" : { "$oid" : "5552db08331a851db38b519e" }, "author" : "/chefs/robert-irvine.htmlhttp://foodnetwork.sndimg.com/content/dam/images/food/unsized/2013/11/25/0/Robert_Irvine.jpg.rend.sni2col.jpegRobert Irvine", "image" : "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2007/8/9/0/ie0201_Veggie_Ragout.jpg.rend.sni12col.landscape.jpeg", "importedFrom" : "http://www.foodnetwork.com/recipes/robert-irvine/v-is-for-vegetarian-ragout-over-cheese-polenta-with-red-pepper-coulis-recipe.html", "ingredients" : [ "3 tablespoons cornstarch", "1 1/2 cups vegetable broth", "3 ounces (6 tablespoons or 3/4 stick) butter", "2 roasted red bell peppers, seeded and peeled", "1 clove garlic", "2 cups vegetable stock", "2 cups heavy cream", "1 cup cornmeal", "1 cup grated Parmesan", "Salt and pepper", "1/8 cup grapeseed oil", "1 onion, medium diced", "2 cloves garlic, chopped", "1 carrot, peeled and diced medium", "1 zucchini, medium dice", "1 yellow squash, medium dice", "1 small eggplant, medium dice", "3 tablespoons tomato paste", "1 tablespoon chopped fresh parsley leaves", "2 teaspoons chopped fresh thyme leaves", "1/4 cup kalamata pitted black olives, cut in 1/2", "Kosher salt", "Freshly ground black pepper", "2 fresh plum tomatoes, diced", "6 to 8 sprigs fresh basil" ], "instructions" : [ "Directions For the Coulis: Whisk the cornstarch into the vegetable broth. Melt the butter over medium heat in a saute pan, and then add the chicken broth mixture, red peppers and garlic. Simmer 30 minutes. *Pour hot mixture into blender and blend until smooth to make red pepper sauce. While the pepper sauce is simmering, begin the polenta.For the Polenta:Combine vegetable stock and cream in a large heavy saucepan. Heat to a gentle boil over medium heat, being careful not to burn. While whisking constantly, gradually add the cornmeal. Once cornmeal is incorporated, keep heat low and continue to whisk until mixture is slightly thickened and creamy. Stir in Parmesan, and season with pepper. (Since Parmesan is salty, add salt only if needed). Set aside in a warm place.For the Ragout:Heat oil in a saute pan. Saute onion, garlic, carrot, zucchini, yellow squash, and eggplant, until they begin to soften. Stir in tomato paste, chopped fresh parsley, thyme, and let cook until flavors integrate, about 10 more minutes. Add olives and heat through. Season with salt and pepper, as needed. Remove from heat and stir in fresh tomato. Let sit to rest.To plate:place cheese polenta onto serving plate, making a well in the center. Top with vegetable ragout in the center, and spoon red pepper coulis over top. Garnish with fresh basil.*When blending hot liquids: Remove liquid from the heat and allow to cool for at least 5 minutes. Transfer liquid to a blender or food processor and fill it no more than halfway. If using a blender, release one corner of the lid. This prevents the vacuum effect that creates heat explosions. Place a towel over the top of the machine, pulse a few times then process on high speed until smooth. 2007, Robert Irvine, All Rights Reserved   CATEGORIES:  Vegetables", "Main Dish", "Polenta", "View All   <div class=\"popover-content categories\">  <ul> <li>Main Ingredient</li>            <li ><a href=\"/content/food/topics/g/grilled-vegetable-recipes.html\">Vegetables</a></li>               <li class=\"last\"><a href=\"/content/food/topics/c/cornmeal.html\">Cornmeal</a></li>     </ul>  <ul> <li>Course</li>            <li ><a href=\"/content/food/topics/m/main-dish.html\">Main Dish</a></li>               <li class=\"last\"><a href=\"/content/food/topics/s/side-dish.html\">Side Dish</a></li>     </ul>  <ul> <li>Dish</li>            <li class=\"last\"><a href=\"/content/food/topics/p/polenta.html\">Polenta</a></li>     </ul>  <ul> <li>Who's Dining</li>            <li class=\"last\"><a href=\"/content/food/topics/f/for-a-crowd.html\">For A Crowd</a></li>     </ul>  <ul> <li>Cooking Style</li>            <li class=\"last\"><a href=\"/content/food/topics/v/vegetarian-recipes.html\">Vegetarian</a></li>     </ul>  <ul> <li>Season</li>            <li class=\"last\"><a href=\"/content/food/topics/s/summer.html\">Summer</a></li>     </ul>  </div>" ], "name" : "\"V\" is for Vegetarian Ragout over Cheese Polenta with Red Pepper Coulis", "recipeYield" : "6 to 8 servings", "tags" : [], "url" : "-v--is-for-vegetarian-ragout-over-cheese-polenta-with-red-pepper-coulis" }
